[
  {
    "title": "Ambush",
    "link": "https://starwars.fandom.com/wiki/Ambush",
    "description": "Jedi Master Yoda is on a secret mission to forge a treaty with the King of the strategic system of Toydaria when his ship is ambushed by Count Dooku. Yoda and three Clone troopers must face off against Count Dooku's dreaded assassin Ventress and her massive droid army to prove the Jedi are strong enough to protect the king and his people from the forces of the war.",
    "crawl": "A galaxy divided by war! Peaceful worlds must choose sides or face the threat of invasion. Republic and Separatist armies vie for the allegiance of neutral planets. Desperate to build a Republic supply base on the system of Toydaria, Jedi Master Yoda travels to secret negotiations on a remote neutral moon....",
    "season": 1,
    "episode": 1,
    "date": "22 BBY",
    "irl_date": "2008-10-03T00:00:00"
  },
  {
    "title": "Rising Malevolence",
    "link": "https://starwars.fandom.com/wiki/Rising_Malevolence",
    "description": "Creating panic throughout the galaxy, a devastating Separatist mystery weapon terrorizes the clone starfleet. Anakin and Ahsoka race to save Jedi Master Plo Koon and his clone troopers in time. Jedi Master Plo Koon and his squad barely survive an attack from a mysterious Separatist warship called the Malevolence. Can they stay alive long enough for Anakin and Ahsoka to find them?",
    "crawl": "The clone star fleet is under siege! Dozens of Republic warships have been destroyed in merciless surprise attacks that leave no survivors. Rumors spread of a terrible new Separatist weapon. In the face of growing fear, the Jedi Council sends Master Plo Koon to hunt down the menace before it strikes again....",
    "season": 1,
    "episode": 2,
    "date": "22 BBY",
    "irl_date": "2008-10-03T00:00:00"
  },
  {
    "title": "Shadow of Malevolence",
    "link": "https://starwars.fandom.com/wiki/Shadow_of_Malevolence",
    "description": "With the help of his Padawan Ahsoka and Jedi Master Plo Koon, Anakin utilizes new long-range Y-wing bombers to lead a bold strike on General Grievous' warship the Malevolence and its destructive weapon. As General Grievous uses the Malevolence to terrorize medical bases, the Jedi rush to defend Republic space. With help from his Padawan and Master Plo Koon, Anakin leads a bold strike mission into enemy territory.",
    "crawl": "A deadly weapon, unleashed! The Separatist battleship ''Malevolence'' advances unopposed through Republic space, tearing apart any ship that stands in its path. After a daring rescue and narrow escape, Anakin Skywalker prepares a counterattack on the enemy ship and its diabolical droid commander, General Grievous....",
    "season": 1,
    "episode": 3,
    "date": "22 BBY",
    "irl_date": "2008-10-10T00:00:00"
  },
  {
    "title": "Destroy Malevolence",
    "link": "https://starwars.fandom.com/wiki/Destroy_Malevolence",
    "description": "Padmé Amidala and C-3PO are taken hostage by General Grievous, leaving Anakin and Obi-Wan to save the Senator and complete the destruction of the Malevolence. Anakin and Obi-Wan chase down the Malevolence, hoping to destroy it before it can escape. But when Padmé and C-3PO are captured and held hostage aboard, the Jedi are forced to hatch a new plan.",
    "crawl": "Grievous in retreat! Before the battleship Malevolence could destroy an Outer Rim clone medical base, a Republic strike force, under the command of Jedi General Anakin Skywalker, crippled the warship, disabling its dreaded ion cannon. Now the Jedi relentlessly pursue the Malevolence....",
    "season": 1,
    "episode": 4,
    "date": "22 BBY",
    "irl_date": "2008-10-17T00:00:00"
  },
  {
    "title": "Rookies (episode)",
    "link": "https://starwars.fandom.com/wiki/Rookies_(episode)",
    "description": "Alone on a distant outpost, Clone Commander Cody and Clone Captain Rex must inspire the rookie clones to believe in themselves to stave off a Commando droid invasion.",
    "crawl": "Clone forces rally! As the war escalates in the Outer Rim, the Jedi Knights are spread thinly across the galaxy. Many new clones are rushed into service to support their Jedi generals. Unfortunately, because of the relentless demands of battle, many young clones must join the struggle before their intensive training has been completed. These clones, manning a vital network of tracking stations, are all that stand between the Republic and invasion…",
    "season": 1,
    "episode": 5,
    "date": "22 BBY",
    "irl_date": "2008-10-24T00:00:00"
  },
  {
    "title": "Downfall of a Droid",
    "link": "https://starwars.fandom.com/wiki/Downfall_of_a_Droid",
    "description": "R2-D2 is lost during a fierce space battle - and Anakin, along with Ahsoka and a replacement droid, R3-S6, must find him before the Separatists discover the Jedi military secrets locked in his memory banks.",
    "crawl": "After suffering a series of disastrous defeats at the hands of General Grievous, the Republic's foothold in the Outer Rim is in jeopardy. Commissioned to protect the strategic world of Bothawui, Anakin Skywalker and his weary battle group are all that stands between the system and domination by the droid army....",
    "season": 1,
    "episode": 6,
    "date": "22 BBY",
    "irl_date": "2008-11-07T00:00:00"
  },
  {
    "title": "Duel of the Droids",
    "link": "https://starwars.fandom.com/wiki/Duel_of_the_Droids",
    "description": "Anakin, Ahsoka and replacement droid R3-S6 embark on a dual rescue/sabotage mission when they discover R2-D2 is being held at General Grievous' secret enemy listening post.",
    "crawl": "Missing in action! Anakin Skywalker's heroic droid navigator R2-D2 was lost in battle. When a desperate search fails to locate Artoo, Anakin is forced to take on a new navigator, R3-S6. Now the Jedi embark on a dangerous new mission, to find a secret enemy listening post. Meanwhile, R2-D2 has fallen into the hands of a vile droid smuggler and is on his way to General Grievous who will surely plunder the Republic's secrets hidden within him....",
    "season": 1,
    "episode": 7,
    "date": "22 BBY",
    "irl_date": "2008-11-14T00:00:00"
  },
  {
    "title": "Bombad Jedi",
    "link": "https://starwars.fandom.com/wiki/Bombad_Jedi",
    "description": "On a diplomatic mission to the planet Rodia, Padmé discovers that her old friend and fellow Republic senator Onaconda Farr has allied his planet with the Separatists. In exchange for food and resources for his people, Onaconda captures Padmé and promises to deliver her to Nute Gunray. Sensing Padmé is in trouble, Jar Jar Binks disguises himself as a Jedi, and with the help of C-3PO, courageously fights to rescue his friend and fellow senator.",
    "crawl": "The Clone War threatens the unity of the Republic! As battles rage across the galaxy, more worlds succumb to the seductive lure of the Separatists and leave the Republic. On a vital mission of peace, Senator Padmé Amidala journeys to the Outer Rim world of Rodia, desperate to ensure its loyalty remains to the Republic....",
    "season": 1,
    "episode": 8,
    "date": "22 BBY",
    "irl_date": "2008-11-21T00:00:00"
  },
  {
    "title": "Cloak of Darkness",
    "link": "https://starwars.fandom.com/wiki/Cloak_of_Darkness",
    "description": "Ahsoka and Jedi Master Luminara escort captured Viceroy Nute Gunray to trial, unaware that Count Dooku has dispatched his deadly apprentice assassin Asajj Ventress to free the prisoner and eliminate the Jedi.",
    "crawl": "Viceroy Gunray captured! Senator Padmé Amidala has scored a victory against the Separatist Alliance on the remote world of Rodia, securing the arrest of the diabolical Confederate leader Nute Gunray. The Jedi Council has dispatched Master Luminara Unduli and Anakin Skywalker's Padawan Ahsoka to escort the Viceroy to Coruscant under heavy guard. Once there, he will face trial for his many war crimes....",
    "season": 1,
    "episode": 9,
    "date": "21 BBY",
    "irl_date": "2008-12-05T00:00:00"
  },
  {
    "title": "Lair of Grievous",
    "link": "https://starwars.fandom.com/wiki/Lair_of_Grievous",
    "description": "General Grievous must prove himself worthy of the Separatists when Count Dooku leads Jedi Master Kit Fisto and his former Padawan, the Mon Calamari Jedi Nahdar Vebb to Grievous' villainous enclave.",
    "crawl": "Viceroy Gunray escapes! En route to Coruscant to stand trial for war crimes, evil Separatist leader Nute Gunray has broken free of his Jedi escort. With the help of Count Dooku's sinister agents, the villainous viceroy has made a daring getaway. Alerted to the bold prison break, Jedi Master Kit Fisto has traced the stolen ship to a remote system, hoping to recapture Gunray and return him to justice....",
    "season": 1,
    "episode": 10,
    "date": "21 BBY",
    "irl_date": "2008-12-12T00:00:00"
  },
  {
    "title": "Dooku Captured",
    "link": "https://starwars.fandom.com/wiki/Dooku_Captured",
    "description": "During their own attempt to kidnap Count Dooku, Anakin and Obi-Wan discover that the Sith Lord has already been captured by pirates.",
    "crawl": "Manhunt! After a long and perilous search, the Jedi finally track down Separatist leader, Count Dooku. During a heroic attempt to capture the Count, Anakin Skywalker has gone missing. Having lost contact with Skywalker, Obi-Wan Kenobi heads toward his friend's last known location: a lone Separatist frigate in the far reaches of the Outer Rim....",
    "season": 1,
    "episode": 11,
    "date": "21 BBY",
    "irl_date": "2009-01-02T00:00:00"
  },
  {
    "title": "The Gungan General",
    "link": "https://starwars.fandom.com/wiki/The_Gungan_General",
    "description": "While negotiating Count Dooku's ransom, Anakin and Obi-Wan are taken prisoner. The Jedi and Sith form an unlikely alliance in a bid to escape, with Jar Jar Binks as their only hope.",
    "crawl": "Dooku held for ransom! After escaping capture by Jedi Knights Anakin Skywalker and Obi-Wan Kenobi, the villainous Count Dooku fell into the clutches of pirates led by the brigand Hondo Ohnaka. Eager to get custody of Dooku, the Republic agreed to pay Hondo a hefty sum in exchange for the Sith Lord. But Anakin and Obi-Wan had not counted on the treacherous cunning of Ohnaka and his band....",
    "season": 1,
    "episode": 12,
    "date": "21 BBY",
    "irl_date": "2009-01-09T00:00:00"
  },
  {
    "title": "Jedi Crash",
    "link": "https://starwars.fandom.com/wiki/Jedi_Crash",
    "description": "When Anakin Skywalker is gravely injured in battle, Jedi General Aayla Secura must teach Ahsoka the Jedi philosophy of having no personal attachments -- while they brave a hostile planet in search of medical help for the Jedi Knight.",
    "crawl": "The Republic fleet is on the defensive and pushed to the brink! As war rages in the much contested Outer Rim Territories, chaos and fear mount as the Separatist army wages an epic battle against heavily outnumbered Republic ships in the far reaches of the Quell system. Anakin Skywalker and his Padawan Ahsoka race across the galaxy to aid Jedi Knight Aayla Secura who is in the midst of a fight for her life as the sinister droid army closes in....",
    "season": 1,
    "episode": 13,
    "date": "21 BBY",
    "irl_date": "2009-01-16T00:00:00"
  },
  {
    "title": "Defenders of Peace",
    "link": "https://starwars.fandom.com/wiki/Defenders_of_Peace",
    "description": "While the Jedi combat a new Separatist weapon, the pacifist Lurmen must decide whether they will lay down to the oppressive Separatists or fight with Anakin, Ahsoka and Jedi General Aayla Secura.",
    "crawl": "Republic forces in retreat! While rescuing General Aayla Secura from certain defeat, Anakin Skywalker has been seriously injured. After a narrow escape, our heroes crash-landed on the remote world of Maridun. Stranded, and with no way to contact the Republic, the Jedi receive medical aid from the peaceful Lurmen colonists. But even on this tiny planet, the war threatens to follow the Jedi....",
    "season": 1,
    "episode": 14,
    "date": "21 BBY",
    "irl_date": "2009-01-23T00:00:00"
  },
  {
    "title": "Trespass",
    "link": "https://starwars.fandom.com/wiki/Trespass",
    "description": "While investigating the disappearance of a clone security force, Anakin and Obi-Wan get caught in the middle of an escalating conflict between the furry territorial inhabitants of a desolate ice world and the greedy representatives of a nearby moon.",
    "crawl": "Republic outpost, overrun! The Jedi have lost all contact with the clone security force stationed on the bleak, snow-covered planet of Orto Plutonia. Obi-Wan Kenobi and Anakin Skywalker, accompanied by dignitaries from the nearby moon of Pantora are sent to investigate the disappearance of the clone troopers on the desolate and forbidding landscape....",
    "season": 1,
    "episode": 15,
    "date": "21 BBY",
    "irl_date": "2009-01-30T00:00:00"
  },
  {
    "title": "The Hidden Enemy",
    "link": "https://starwars.fandom.com/wiki/The_Hidden_Enemy",
    "description": "Anakin and Obi-Wan discover evidence of a traitor amongst their ranks while attempting to lead Republic forces to liberate the planet of Christophsis from a Separatist siege. When the Republic is ambushed on Christophsis, it becomes clear that someone has set them up. The Jedi suspect the Sith, while Rex and Cody uncover information that points to a spy amongst them.",
    "crawl": "A planet under siege! Separatist forces mercilessly batter the beautiful and elegant world of Christophsis. Unable to defend themselves any longer, the people of Christophsis call upon the Jedi for assistance. Hoping to save lives and prevent further destruction, Obi-Wan Kenobi and Anakin Skywalker plan a daring ambush which can turn the tide in the fight for this crucial star system...",
    "season": 1,
    "episode": 16,
    "date": "22 BBY",
    "irl_date": "2009-02-06T00:00:00"
  },
  {
    "title": "Blue Shadow Virus (episode)",
    "link": "https://starwars.fandom.com/wiki/Blue_Shadow_Virus_(episode)",
    "description": "Padmé and Jar Jar are captured while searching for a secret Separatist bio-weapons lab, sparking Anakin, Obi-Wan and Ahsoka to try and save their friends and halt the release of a deadly virus.",
    "crawl": "Battle droids on Naboo! As the Separatist rebellion rages through the galaxy, even peaceful planets are threatened. Following the discovery of Separatist droids wandering the grassy wasteland, Naboo is once again on high alert. Fearing their home is facing another invasion, Senator Amidala and Representative Binks race to Naboo to assess the situation. Meanwhile, near the Gungan swamplands, an even graver threat is about to be discovered....",
    "season": 1,
    "episode": 17,
    "date": "21 BBY",
    "irl_date": "2009-02-13T00:00:00"
  },
  {
    "title": "Mystery of a Thousand Moons",
    "link": "https://starwars.fandom.com/wiki/Mystery_of_a_Thousand_Moons",
    "description": "The fatal Blue Shadow Virus is released, infecting Ahsoka, Padmé and many Clone Troopers - and giving Anakin and Obi-Wan just 48 hours to find the antidote on a mysterious planet from which no visitor has ever returned.",
    "crawl": "Hard-pressed Jedi and their valiant clone troopers have thwarted an insidious Separatist plot to plant bombs loaded with the deadly Blue Shadow Virus in key Republic systems. Obi-Wan Kenobi and Anakin Skywalker have captured the vile scientist behind the nefarious scheme: Doctor Nuvo Vindi. Now the Jedi plan to transport Vindi to the Republic capital for trial....",
    "season": 1,
    "episode": 18,
    "date": "21 BBY",
    "irl_date": "2009-02-13T00:00:00"
  },
  {
    "title": "Storm Over Ryloth",
    "link": "https://starwars.fandom.com/wiki/Storm_Over_Ryloth",
    "description": "Ahsoka disobeys Anakin's orders and loses most of her squadron - prompting Anakin to help give his Padawan a lesson in a respect for authority, and the opportunity for redemption.",
    "crawl": "Planet Ryloth invaded! Subjected to a brutal droid occupation, the people of Ryloth are starving under the blockade of a Separatist fleet. Evil Separatist leader Wat Tambor now rules with an iron fist. Answering a plea from the Senate, the Grand Army of the Republic mounts a bold offensive to liberate the system. It is up to Anakin Skywalker and his Padawan Ahsoka to make way for Obi-Wan's ground assault....",
    "season": 1,
    "episode": 19,
    "date": "21 BBY",
    "irl_date": "2009-02-27T00:00:00"
  },
  {
    "title": "Innocents of Ryloth",
    "link": "https://starwars.fandom.com/wiki/Innocents_of_Ryloth",
    "description": "To sabotage a powerful Separatist weapon, Obi-Wan and a small clone force enter an occupied town, and discover that its residents are being used as a living shield.",
    "crawl": "Invasion! Separatist leader Wat Tambor has taken control of the planet Ryloth and subjugates its people through a brutal droid occupation. In a daring surprise attack, Jedi Anakin Skywalker and his Padawan, Ahsoka Tano defeated the space blockade guarding the planet. Now, Jedi Generals Mace Windu and Obi-Wan Kenobi lead a massive invasion to liberate the starving people....",
    "season": 1,
    "episode": 20,
    "date": "21 BBY",
    "irl_date": "2009-03-06T00:00:00"
  },
  {
    "title": "Liberty on Ryloth",
    "link": "https://starwars.fandom.com/wiki/Liberty_on_Ryloth",
    "description": "With his forces stretched thin, Mace Windu must convince Twi'lek freedom fighter Cham Syndulla to help him save the capital city from the droids' destruction.",
    "crawl": "Republic victory is at hand! Clone troopers under the command of the Jedi have successfully invaded the Separatist-occupied world of Ryloth. Anakin Skywalker battles the enemy in the skies, while Obi-Wan Kenobi frees villages from the grip of vile Separatist leader, Wat Tambor. Now, Jedi General Mace Windu leads the attack on the enemy lines in the final offensive to liberate the capital city of Lessu....",
    "season": 1,
    "episode": 21,
    "date": "21 BBY",
    "irl_date": "2009-03-13T00:00:00"
  },
  {
    "title": "Hostage Crisis",
    "link": "https://starwars.fandom.com/wiki/Hostage_Crisis",
    "description": "To free crime lord Ziro the Hutt, bounty hunters seize control of the Senate Building and take hostages—completely unaware at first that Jedi Knight Anakin Skywalker is still inside.",
    "crawl": "Danger looms! Despite recent victories in the Outer Rim, criminal minds plot at the very heart of the Republic! The bounty hunter Cad Bane has assembled some of the deadliest criminals in the galaxy and plans a daring attack to seize members of the Senate. What can be the aim of this despicable act?",
    "season": 1,
    "episode": 22,
    "date": "21 BBY",
    "irl_date": "2009-03-20T00:00:00"
  },
  {
    "title": "Holocron Heist",
    "link": "https://starwars.fandom.com/wiki/Holocron_Heist",
    "description": "Cad Bane infiltrates the Jedi Temple and attempts to steal an ancient Jedi Holocron. It's up to Ahsoka, Anakin, and Obi-Wan to stop the bounty hunter from escaping with the valuable Jedi artifact.",
    "crawl": "Jedi trapped on Felucia! Clones are surrounded by droid forces. Their only hope is to escape on Republic gunships waiting to land on the embattled surface. Jedi cruisers have managed to blow a hole in the droid defenses, and have sent gunships to the rescue.",
    "season": 2,
    "episode": 1,
    "date": "21 BBY",
    "irl_date": "2009-10-02T00:00:00"
  },
  {
    "title": "Cargo of Doom",
    "link": "https://starwars.fandom.com/wiki/Cargo_of_Doom",
    "description": "Anakin and Ahsoka intercept Cad Bane's warship, hoping to recover the stolen Jedi Holocron, but the Jedi underestimate the bounty hunter's cunning tactics.",
    "crawl": "Stolen secrets! Villainous mercenary Cad Bane was hired by Darth Sidious to steal a holocron from the vaults of the Jedi Temple. After fleeing the scene of the crime, Bane hunted down and captured Master Bolla Ropal, who has a crystal which holds the secrets of the Jedi Order. As a Separatist fleet arrives to help the bounty hunter, Anakin Skywalker races in to cut off their escape and stop Bane from delivering the stolen holocron….",
    "season": 2,
    "episode": 2,
    "date": "21 BBY",
    "irl_date": "2009-10-02T00:00:00"
  },
  {
    "title": "Children of the Force",
    "link": "https://starwars.fandom.com/wiki/Children_of_the_Force",
    "description": "Darth Sidious has a new dark assignment for bounty hunter Cad Bane: kidnap Force-sensitive children from across the galaxy and bring them to Mustafar.",
    "crawl": "A thief hunted! In a daring assault Anakin Skywalker and his Padawan Ahsoka boarded the warship of cunning bounty hunter Cad Bane to recover a stolen holocron containing a list of the galaxy's Force-sensitive children and future Jedi Knights. After a desperate chase and duel with the villain, Anakin and his troops defeated Bane, but were forced to evacuate his doomed vessel without the holocron...",
    "season": 2,
    "episode": 3,
    "date": "21 BBY",
    "irl_date": "2009-10-09T00:00:00"
  },
  {
    "title": "Senate Spy",
    "link": "https://starwars.fandom.com/wiki/Senate_Spy",
    "description": "At the Jedi High Council's request, Padmé investigates a Separatist conspiracy in the Senate.",
    "crawl": "Treachery in the Senate! The Jedi Council suspects that Senator Rush Clovis is secretly taking part in a Separatist conspiracy. But to find out what the Senator from Scipio is up to, the Council will need a spy of its own. Meanwhile, Jedi Anakin Skywalker has been away from Coruscant on a lengthy tour of duty leading the clone army. Now Anakin returns for a long-awaited reunion with his wife, Padmé Amidala...",
    "season": 2,
    "episode": 4,
    "date": "21 BBY",
    "irl_date": "2009-10-16T00:00:00"
  },
  {
    "title": "Landing at Point Rain",
    "link": "https://starwars.fandom.com/wiki/Landing_at_Point_Rain",
    "description": "Anakin, Ahsoka, Obi-Wan, and Ki-Adi-Mundi lead a landing party to destroy a droid factory on Geonosis.",
    "crawl": "Counterattack! With the clone army stretched in desperate attempt to engage General Grievous' Starfleet, Separatists planets that were once thought secure are now rising up against the Republic. On Geonosis, Separatist leader Poggle the Lesser, safe in his newly ray-shielded factories, creates thousands of terrible new weapons which march off the assembly line against the outnumbered clone army. The Jedi, resolute in their effort to restore order to the Republic, mount a massive invasion to retake Geonosis and shut down Poggle's factories of terror once and for all....",
    "season": 2,
    "episode": 5,
    "date": "21 BBY",
    "irl_date": "2009-11-04T00:00:00"
  },
  {
    "title": "Weapons Factory",
    "link": "https://starwars.fandom.com/wiki/Weapons_Factory",
    "description": "Luminara and Anakin act as decoys to divert new enemy super-tanks, while Padawans Barriss Offee and Ahsoka attempt to destroy a Separatist droid factory.",
    "crawl": "The final surge. Having learned of warlord Poggle the Lesser's plot to rebuild a Separatist droid foundry on Geonosis, Jedi Knight Anakin Skywalker and his Padawan, Ahsoka Tano, prepare to assault this heavily- fortified installation. Their mission: destroy the factory at all costs. Anticipating stiff resistance, Republic commanders send Jedi Master Luminara Unduli and her Padawan, Barriss Offee, to reinforce the attack. But time runs short for our intrepid heroes as the dreaded droid mill nears completion....",
    "season": 2,
    "episode": 6,
    "date": "21 BBY",
    "irl_date": "2009-11-13T00:00:00"
  },
  {
    "title": "Legacy of Terror",
    "link": "https://starwars.fandom.com/wiki/Legacy_of_Terror",
    "description": "\"When Luminara goes missing, Obi-Wan and Anakin lead a platoon of clones in search of her. When the search leads to a mysterious lair, the Jedi are faced with a horde of undead warriors.\"",
    "crawl": "Victory on Geonosis! After a massive planetary siege, the Separatist forces on Geonosis have finally fallen. Key weapons factories have been destroyed, but at a heavy cost to Republic troops. Now, as Jedi Master Luminara Unduli and Obi-Wan Kenobi begin a clean-up of the planet, they launch an intense campaign to find Separatist leader Poggle the Lesser and bring him to justice....",
    "season": 2,
    "episode": 7,
    "date": "21 BBY",
    "irl_date": "2009-11-20T00:00:00"
  },
  {
    "title": "Brain Invaders",
    "link": "https://starwars.fandom.com/wiki/Brain_Invaders",
    "description": "\"When Geonosian brain worms take control of their supply ship, Ahsoka and Barriss must battle to stop the vessel from unleashing the deadly plague upon the galaxy.\"",
    "crawl": "Victory on Geonosis! After a massive assault, the Republic has finally recaptured the Separatist planet and shut down its droid factories of doom. An investigation by Luminara Unduli led to the discovery of Queen Karina the Great, whose hive-mind could reanimate dead Geonosian soldiers. During the destruction of the queen's temple, the Jedi apprehended her advisor Poggle the Lesser, and now prepare to deliver the villain to Coruscant for trial....",
    "season": 2,
    "episode": 8,
    "date": "21 BBY",
    "irl_date": "2009-12-04T00:00:00"
  },
  {
    "title": "Grievous Intrigue",
    "link": "https://starwars.fandom.com/wiki/Grievous_Intrigue",
    "description": "A Jedi Master is taken hostage and tortured by General Grievous. Anakin, Obi-Wan, and Adi Gallia devise a daring rescue plan, but they soon realize the General has a plan of his own.",
    "crawl": "Diabolical defeat! Though Republic victories outnumber their losses, the Jedi have been unable to stop Separatist advances in the Outer Rim. The ever-elusive General Grievous stays one step ahead of his opponents. With thousands of droid armies at his command, the Jedi can never predict where Grievous will strike next until now...",
    "season": 2,
    "episode": 9,
    "date": "21 BBY",
    "irl_date": "2010-01-01T00:00:00"
  },
  {
    "title": "The Deserter",
    "link": "https://starwars.fandom.com/wiki/The_Deserter",
    "description": "While searching for General Grievous on a distant planet, Rex encounters a deserter.",
    "crawl": "Fugitive! Though the Republic has won many decisive battles against the Separatist army in the Outer Rim, the Jedi have failed to capture the elusive General Grievous. After specifically targeting members of the Jedi Council, a trap was set. But following a fierce confrontation, the droid general managed to escape to the surface of the planet Saleucami. Now, the chase is on as General Kenobi leads a squadron of clone troopers and closes in on his desperate target....",
    "season": 2,
    "episode": 10,
    "date": "21 BBY",
    "irl_date": "2010-01-01T00:00:00"
  },
  {
    "title": "Lightsaber Lost",
    "link": "https://starwars.fandom.com/wiki/Lightsaber_Lost",
    "description": "When a wily pickpocket steals Ahsoka's lightsaber, she enlists the help of an ancient Jedi to track down her weapon and reclaim her honor.",
    "crawl": "War creates opportunity for the criminal underworld! Ruthless mercenaries conspire with the Separatists to disrupt and exploit the unstable situation within the Republic. Now, Anakin Skywalker and Ahsoka Tano descend into the treacherous gangster havens in an effort to find a corrupt and vile arms dealer who is buying weapons on the black market and selling them to the Republic's enemies....",
    "season": 2,
    "episode": 11,
    "date": "21 BBY",
    "irl_date": "2010-01-22T00:00:00"
  },
  {
    "title": "The Mandalore Plot",
    "link": "https://starwars.fandom.com/wiki/The_Mandalore_Plot",
    "description": "While investigating rumors of conspiracy surrounding Duchess Satine of Mandalore, Obi-Wan uncovers the truth about a mysterious Mandalorian plot.",
    "crawl": "Diplomacy or deception? The Council of Neutral Systems speaks for over 1,500 worlds who want to stay out of the war. But rumors have reached the Republic Senate suggesting that the Council's new leader — Duchess Satine of Mandalore — is secretly building her own army to fight for the Separatist cause! Now, Jedi Master Obi-Wan Kenobi has been sent to Mandalore to discover the truth behind these claims....",
    "season": 2,
    "episode": 12,
    "date": "21 BBY",
    "irl_date": "2010-01-29T00:00:00"
  },
  {
    "title": "Voyage of Temptation",
    "link": "https://starwars.fandom.com/wiki/Voyage_of_Temptation",
    "description": "As the Jedi and their clones defend Duchess Satine from assassination attempts, Anakin discovers that Obi-Wan and the duchess have a history together.",
    "crawl": "A royal welcome! Sent to investigate allegations that Mandalore was joining Count Dooku's Separatists, Obi-Wan Kenobi was reunited with an old friend, the Duchess Satine of Kalevala. While Satine claimed Mandalore's intentions were to remain neutral during the war, an attack on the capital city led Obi-Wan to the discovery of a terrorist organization known as Death Watch. Now the Duchess travels to the Senate, so she can plead her case against her involvement in the war, as the Jedi prepare a defense against her opponents....",
    "season": 2,
    "episode": 13,
    "date": "21 BBY",
    "irl_date": "2010-02-05T00:00:00"
  },
  {
    "title": "Duchess of Mandalore",
    "link": "https://starwars.fandom.com/wiki/Duchess_of_Mandalore",
    "description": "On Coruscant, word reaches Duchess Satine that Death Watch is mobilizing, sparking a pre-emptive Republic invasion. On the run from Republic authorities, Satine and Obi-Wan set off to discover the group's true motives.",
    "crawl": "A diplomatic mission! As dissent threatens to tear apart the peaceful Mandalore system, Duchess Satine struggles to protect her people against the escalating violence. Betrayed by two of her trusted allies, Satine now travels to Coruscant. There, she hopes to convince the Senate that a destructive splinter group, Death Watch, does not represent the entire Mandalorian government...",
    "season": 2,
    "episode": 14,
    "date": "21 BBY",
    "irl_date": "2010-02-12T00:00:00"
  },
  {
    "title": "Senate Murders",
    "link": "https://starwars.fandom.com/wiki/Senate_Murders",
    "description": "When Senator Onaconda Farr dies under suspicious circumstances, Padmé sets out to find the person responsible for the death of her favorite uncle.",
    "crawl": "War on many fronts! While battles are fought by clones in the field, a different war is waged in the Galactic Senate. As heavy losses add up, a group of senators led by Halle Burtoni of Kamino propose an escalation of troop production. Senator Padmé Amidala, recognizing that more troops will only prolong the fighting, works tirelessly with her allies to introduce a bill to cut down military spending and stop the creation of more clone troopers....",
    "season": 2,
    "episode": 15,
    "date": "21 BBY",
    "irl_date": "2010-03-19T00:00:00"
  },
  {
    "title": "Cat and Mouse",
    "link": "https://starwars.fandom.com/wiki/Cat_and_Mouse",
    "description": "Obi-Wan and Anakin must deliver supplies to Christophsis while the planet is under Separatist control. They encounter Separatist Commander Admiral Trench and get more than they bargained for.",
    "crawl": "An impenetrable defense! Separatist ships blockade the resource-rich planet of Christophsis, trapping Senator Bail Organa and his relief effort. Desperate to aid the esteemed Senator, a Republic task force under the command of Jedi Knight, Anakin Skywalker must break the impasse. But time runs short for the Senator and the good citizens of Christophsis....",
    "season": 2,
    "episode": 16,
    "date": "22 BBY",
    "irl_date": "2010-03-26T00:00:00"
  },
  {
    "title": "Bounty Hunters (episode)",
    "link": "https://starwars.fandom.com/wiki/Bounty_Hunters_(episode)",
    "description": "Anakin Skywalker, Obi-Wan Kenobi, and Ahsoka Tano form an uneasy partnership with four deadly Bounty hunters to help protect a local farmer from Hondo Ohnaka and his band of pirates.",
    "crawl": "The death toll rises! As the battles intensify, and threaten a growing number of Republic worlds, planets are left to survive on their own. While the Jedi struggle to fight a war on many fronts, a series of medical stations have been established as a lifeline for those in need, but the facilities are easy prey for Separatist attacks. After losing contact with the medical station orbiting Felucia, Obi-Wan Kenobi, Anakin Skywalker and Ahsoka Tano are sent to investigate....",
    "season": 2,
    "episode": 17,
    "date": "21 BBY",
    "irl_date": "2010-04-02T00:00:00"
  },
  {
    "title": "The Zillo Beast",
    "link": "https://starwars.fandom.com/wiki/The_Zillo_Beast",
    "description": "The Republic's new super-weapon awakens the fearsome Zillo Beast of Malastare. Now the Jedi must devise a way to contain the deadly creature.",
    "crawl": "Desperate times call for desperate measures! In one of the longest and fiercest battles of the war, Separatist forces are on the verge of claiming the planet of Malastare. If the Republic loses this planet it will cost them vital fuel resources necessary for maintaining their armies. In a final effort to turn the tide of this battle, Supreme Chancellor Palpatine has authorized the use of the Republic's newest weapon: the ELECTRO- PROTON BOMB. Now, at the Imperial palace of Doge Urus, the leader of the Dugs, the Jedi count down the minutes until the detonation of their doomsday device....",
    "season": 2,
    "episode": 18,
    "date": "21 BBY",
    "irl_date": "2010-04-09T00:00:00"
  },
  {
    "title": "The Zillo Beast Strikes Back",
    "link": "https://starwars.fandom.com/wiki/The_Zillo_Beast_Strikes_Back",
    "description": "Republic forces bring the Zillo Beast back to Coruscant for study. When it escapes, the Jedi must choose between saving millions of lives and destroying the Zillo Beast, the last of its kind.",
    "crawl": "A calculated risk! Following a costly victory on the planet Malastare, Chancellor Palpatine orders Jedi Knights Mace Windu and Anakin Skywalker to transport a fearsome Zillo Beast captured during the battle back to Coruscant. After seeing that not even a lightsaber could harm the beast, Chancellor Palpatine hopes to unlock the secret of its invulnerability to create new armor for the Republic's clone troopers. Tensions run high as the most dangerous life form in the galaxy touches down on the Republic's most populous planet....",
    "season": 2,
    "episode": 19,
    "date": "21 BBY",
    "irl_date": "2010-04-16T00:00:00"
  },
  {
    "title": "Death Trap",
    "link": "https://starwars.fandom.com/wiki/Death_Trap",
    "description": "A young boy wages war against the Jedi Knights who left him orphaned, bitter, and alone.",
    "crawl": "Calm before the storm! A rare and welcome respite from endless battle awaits Jedi Knights Anakin Skywalker and Mace Windu as they travel through deep space aboard the Jedi cruiser Endurance. Preparing to rendezvous with a Republic frigate, the Jedi remain unaware of a deadly peril lying hidden in their midst....",
    "season": 2,
    "episode": 20,
    "date": "21 BBY",
    "irl_date": "2010-04-23T00:00:00"
  },
  {
    "title": "R2 Come Home",
    "link": "https://starwars.fandom.com/wiki/R2_Come_Home",
    "description": "When a band of bounty hunters leads Anakin and Mace into a deadly trap on Vanqor, it's up to R2-D2 to battle his way back to Coruscant and warn the Jedi.",
    "crawl": "Revenge! Boba Fett, son of the notorious bounty hunter Jango Fett, infiltrated a Jedi cruiser in an attempt to assassinate General Mace Windu, the man who killed his father. After a near miss at Windu's quarters, Boba was forced to destroy the cruiser and escape with the help of notorious bounty hunter Aurra Sing. Now, having lost contact with Admiral Kilian when his doomed starship crashed, the Jedi search for survivors with aid of a Republic rescue ship....",
    "season": 2,
    "episode": 21,
    "date": "21 BBY",
    "irl_date": "2010-04-30T00:00:00"
  },
  {
    "title": "Lethal Trackdown",
    "link": "https://starwars.fandom.com/wiki/Lethal_Trackdown",
    "description": "After combing the Coruscant Underworld for a young fugitive, Plo Koon and Ahsoka pursue him to Florrum for a climactic confrontation.",
    "crawl": "Lethal trackdown! The young Boba Fett has taken the law into his own hands and made two attempts on the life of Mace Windu, the Jedi Master who killed his father. Boba's mentor, bounty hunter Aurra Sing, has taken three Republic officers hostage in an effort to force Windu to face Boba on their terms, a tactic that does not sit well with the young vigilante....",
    "season": 2,
    "episode": 22,
    "date": "21 BBY",
    "irl_date": "2010-04-30T00:00:00"
  },
  {
    "title": "Clone Cadets",
    "link": "https://starwars.fandom.com/wiki/Clone_Cadets",
    "description": "Five headstrong clones struggle to complete their training on Kamino. These cadets – Hevy, Cutup, Droidbait, Fives, and Echo – seem to be a \"bad batch\" and are unable to work as a team. As Shaak Ti and drill instructors Bric and El-Les debate the cadets' fate, the clones learn to work together and accept their destiny as soldiers.",
    "crawl": "Clone troopers unite! As war rages across the galaxy, the Republic's clone army strives for victory against the evil forces of the Separatists. Bravery, valor, unity -- the lifeblood of victory on the battlefield and in space. It all begins on the planet Kamino, where Jedi General Shaak Ti oversees the training of clones with the help of contracted bounty hunters. Bred to be perfect soldiers, these cadets must first be subjected to intense physical and mental training before heading off to war....",
    "season": 3,
    "episode": 1,
    "date": "22 BBY",
    "irl_date": "2010-09-17T00:00:00"
  },
  {
    "title": "ARC Troopers (episode)",
    "link": "https://starwars.fandom.com/wiki/ARC_Troopers_(episode)",
    "description": "The Republic learns of an impending Separatist attack on Kamino, and Anakin and Obi-Wan hurry to the planet. After the Republic repulses the Separatists' diversionary assault, the real attack begins. Asajj Ventress, General Grievous and an army of droids rise out of the oceans, bent on destroying Kamino's clone production facilities. Rex, Cody, Fives, and Echo lead the clones in a desperate defense of their home planet.",
    "crawl": "Separatist attack! After the destruction of the Republic outpost on the Rishi Moon, General Grievous and Asajj Ventress plan an attack on the planet Kamino, home of the cloning factories. Meanwhile, aboard a Jedi cruiser, Jedi Knights Anakin Skywalker and Obi-Wan Kenobi examine an intercepted message from General Grievous....",
    "season": 3,
    "episode": 2,
    "date": "21 BBY",
    "irl_date": "2010-09-17T00:00:00"
  },
  {
    "title": "Supply Lines",
    "link": "https://starwars.fandom.com/wiki/Supply_Lines",
    "description": "Ryloth is under siege. Trapped on the surface, Jedi Master Di rallies the local forces with the help of Cham Syndulla. Desperate to save them, the Jedi Council dispatches Senator Bail Organa and Representative Jar Jar Binks to the planet Toydaria, where they are to convince the neutral regent, King Katuunko, to send aid to Ryloth. Bail and Jar Jar must convince Toydaria that their cause is just -- before it's too late. Trade Federation envoy Lott Dod attempts to prevent the Toydarians from giving up their neutrality. Katuunko follows his conscience and secretly aids the Republic, which Jar Jar is able to keep secret from the snooping Trade Federation agents with his inimitable distractions.",
    "crawl": "A world under siege! The Separatists have launched a massive offensive against the planet Ryloth. A blockade of deadly battleships has cut off any support for the dwindling Republic defenses. Though they have fought valiantly with the help of Twi'lek freedom fighter Cham Syndulla, hope is fading for Jedi Master Di and his men as the droid army closes in....",
    "season": 3,
    "episode": 3,
    "date": "22 BBY",
    "irl_date": "2010-09-24T00:00:00"
  },
  {
    "title": "Sphere of Influence",
    "link": "https://starwars.fandom.com/wiki/Sphere_of_Influence",
    "description": "Chi Eekway and Che Amanwe, Chairman Papanoida's daughters, are kidnapped and held for ransom. Ahsoka Tano teams up with the Senator from Pantora, Riyo Chuchi, to aid the new chairman in recovering his family before the Trade Federation can unduly influence the future of his planet.",
    "crawl": "Pantora in peril! The newly elected Chairman of Pantora, Baron Papanoida, is caught in a deadly political game. The Trade Federation has blockaded Pantora and suspended all commerce with the system. Isolated from the rest of the Republic, the people of Pantora are beginning to rally against the Senate, who have seemed unsympathetic to their plight. To make matters worse, Count Dooku has come forward offering aid if Pantora joins the Separatist Alliance. Chairman Papanoida has dispatched Senator Chuchi to Coruscant with the hope that she can motivate the Senate to act in favor of Pantora before Lott Dod can legitimize the blockade....",
    "season": 3,
    "episode": 4,
    "date": "21 BBY",
    "irl_date": "2010-10-01T00:00:00"
  },
  {
    "title": "Corruption (episode)",
    "link": "https://starwars.fandom.com/wiki/Corruption_(episode)",
    "description": "Padmé, on a diplomatic mission to Mandalore, guarantees the pacifist planet the Republic's full protection, but she and Duchess Satine soon find something sinister lurking beneath the planet's serene façade. Moogan smugglers have been sneaking in supplies, including bottled tea destined for the Mandalorian schools. To increase their profits, they have been diluting the tea with a hazardous chemical.",
    "crawl": "Desperate times on Mandalore! Having won neutrality for the Mandalorian system, Duchess Satine now finds herself an outsider with very little aid to her people. Supplies are hard to come by, except on the black market. As a result, the Duchess faces a world consumed by greed. Hoping to alleviate some of the tension rising in the capital city of Sundari, Satine has called upon her friend Padmé Amidala to make a diplomatic visit....",
    "season": 3,
    "episode": 5,
    "date": "21 BBY",
    "irl_date": "2010-10-08T00:00:00"
  },
  {
    "title": "The Academy",
    "link": "https://starwars.fandom.com/wiki/The_Academy",
    "description": "Ahsoka Tano is assigned to teach a class at a leadership academy on Mandalore. Soon after she arrives, Duchess Satine's zealous nephew -- Korkie Kryze -- and his classmates uncover a nefarious plot. Prime Minister Almec is revealed to be an active part of the Mandalorian black market conspiracy on Mandalore, and he attempts to permanently silence Duchess Satine and the cadets before they expose his corruption. Ahsoka and the cadets defeat Almec before he can succeed.",
    "crawl": "A world in crisis! The peaceful planet of Mandalore is being strangled by the grip of corruption. With shortages of every kind, citizens must turn to the black market in order to survive. Desperate to free her people, Duchess Satine has asked her friend Padmé Amidala to speak with the Jedi Council in hopes that they will send assistance to her struggling world....",
    "season": 3,
    "episode": 6,
    "date": "21 BBY",
    "irl_date": "2010-10-15T00:00:00"
  },
  {
    "title": "Assassin (episode)",
    "link": "https://starwars.fandom.com/wiki/Assassin_(episode)",
    "description": "Tasked to protect Senator Padmé Amidala during a political mission to Alderaan, Padawan Ahsoka Tano is plagued by recurring visions of the recently-deceased bounty hunter, Aurra Sing. Unable to clear her mind, Ahsoka worries that the stress of conflict is finally getting to her until her visions indeed prove prophetic. Padmé narrowly avoids death when Aurra Sing attempts to assassinate her. Together, Padmé and Ahsoka trap the hunter, and Ahsoka discovers the true villain behind the plot to kill Padmé: the incarcerated gangster, Ziro the Hutt.",
    "crawl": "Criminals captured! Jedi Master Plo Koon and Padawan Ahsoka Tano successfully thwarted an attempt on Mace Windu's life, killing bounty hunter Aurra Sing in the process. Since that time, young Ahsoka has grown strong in the ways of the Force. Now, after several harrowing adventures alongside her Master, the two Jedi have returned to the Temple on Coruscant to receive their next mission....",
    "season": 3,
    "episode": 7,
    "date": "21 BBY",
    "irl_date": "2010-10-22T00:00:00"
  },
  {
    "title": "Evil Plans",
    "link": "https://starwars.fandom.com/wiki/Evil_Plans",
    "description": "In the middle of a routine shopping trip on Coruscant, C-3PO is abducted by the bounty hunter Cad Bane. Bane is looking for information about the Senate Building on behalf of Jabba the Hutt. Finding C-3PO devoid of useful information, Bane and his accomplices kidnap R2-D2 and extract the vital data, before memory wiping the droids of the incident, and letting them on their way. The floor-plans and security details of the Senate building are part of a plot engineered by the Hutt families to free their imprisoned brother, Ziro the Hutt, who holds potentially damaging information about Hutt activities.",
    "crawl": "Evil plans! With the Jedi Council focused on the war effort, criminal minds are left unchecked to spread fear and corruption. Galactic gangster Jabba the Hutt has sent bounty hunter Cad Bane on a nefarious mission, which shall strike at the heart of the Republic. Meanwhile, the unsuspecting citizens of Coruscant go about their daily lives....",
    "season": 3,
    "episode": 8,
    "date": "21 BBY",
    "irl_date": "2010-11-05T00:00:00"
  },
  {
    "title": "Hunt for Ziro",
    "link": "https://starwars.fandom.com/wiki/Hunt_for_Ziro",
    "description": "Cad Bane has broken Ziro the Hutt out of prison and the Hutt Council demands that Ziro tell them where he's hidden vital -- and incriminating -- information: a journal detailing the criminal activities of the five Hutt families. Ziro makes another daring escape with the help of his estranged (and strange) lover, Sy Snootles. Bane is back on the Hutt's trail -- but he's not the only one. The Jedi Obi-Wan Kenobi and Quinlan Vos need to find him too.",
    "crawl": "A great escape! Cad Bane and his notorious crew of bounty hunters liberated Ziro the Hutt from a Republic prison after holding the Galactic Senate hostage. The Jedi Council has assigned Obi-Wan Kenobi to retrieve Ziro the Hutt with the help of Jedi Knight Quinlan Vos. Unknown to the Jedi, we find Ziro in the clutches of the five Hutt families on the distant world of Nal Hutta....",
    "season": 3,
    "episode": 9,
    "date": "21 BBY",
    "irl_date": "2010-11-12T00:00:00"
  },
  {
    "title": "Heroes on Both Sides",
    "link": "https://starwars.fandom.com/wiki/Heroes_on_Both_Sides",
    "description": "When the Senate begins debating a bill that would eliminate government oversight of the Banking Clan's activities in order to fund the war, Padmé and Ahsoka travel in secret to the capital of the Confederacy of Independent Systems. Amidala attempts to forge a peace agreement with the Separatists, while Ahsoka sees, for the first time, the people of the Confederacy. Padmé's friend, Mina Bonteri, spearheads the peace initiative, and convinces the Separatist Congress to sue for peace.",
    "crawl": "Conflict with no end in sight! Across the galaxy, the quagmire of war continues. While clone troopers suffer casualties at alarming rates, the Galactic Senate convenes an emergency session to debate the true cost of the war....",
    "season": 3,
    "episode": 10,
    "date": "21 BBY",
    "irl_date": "2010-11-19T00:00:00"
  },
  {
    "title": "Pursuit of Peace",
    "link": "https://starwars.fandom.com/wiki/Pursuit_of_Peace",
    "description": "Padmé Amidala, Bail Organa and Onaconda Farr attempt to rally Senators in opposition to a bill that would appropriate funds for millions of new clone troops and have disastrous financial consequences for the Republic. Their opposition to the measure, however, soon makes them targets for intimidation and attacks by hired guns. After escaping two hired thugs — Chata Hyoki and Robonino — in a harrowing speeder bike chase, Padmé, is able to sway the Senate with a stirring account of how the war has affected an everyday civilian, her handmaiden Teckla Minnau.",
    "crawl": "Peace shattered! Once-promising negotiations between the Republic and the Separatists are now in shambles following a droid suicide bombing on the capital city planet of Coruscant. As fear and anger prevail, the Senate overwhelmingly passes a bill to deregulate the banks, opening a gateway to additional troops, and an increase in fighting....",
    "season": 3,
    "episode": 11,
    "date": "21 BBY",
    "irl_date": "2010-12-03T00:00:00"
  },
  {
    "title": "Nightsisters (episode)",
    "link": "https://starwars.fandom.com/wiki/Nightsisters_(episode)",
    "description": "Troubled by Asajj Ventress' growing prowess with the dark side of the Force, Darth Sidious commands Count Dooku to eliminate her. But Ventress survives Dooku's assassination attempt, and the jilted former apprentice vows to take revenge, enlisting the aid of her kinswomen -- the mystical Nightsisters -- in her sinister scheme.",
    "crawl": "Galactic showdown! In a fierce battle for survival, the Republic and Separatist armies have clashed in the distant Sullust system. Count Dooku's most cunning assassin, Asajj Ventress, leads the vicious attack....",
    "season": 3,
    "episode": 12,
    "date": "20 BBY",
    "irl_date": "2011-01-07T00:00:00"
  },
  {
    "title": "Monster",
    "link": "https://starwars.fandom.com/wiki/Monster",
    "description": "",
    "crawl": "A bid for revenge! Betrayed and left for dead by Count Dooku, Asajj Ventress has begun a deadly game with her former Master, launching a secret assassination attempt against him with the help of her kin, the mysterious Nightsisters. Deceived into thinking the Jedi were behind the recent attack, Dooku has traveled across the galaxy to enlist the Nightsisters in his quest for vengeance....",
    "season": 3,
    "episode": 13,
    "date": "20 BBY",
    "irl_date": "2011-01-14T00:00:00"
  },
  {
    "title": "Witches of the Mist",
    "link": "https://starwars.fandom.com/wiki/Witches_of_the_Mist",
    "description": "",
    "crawl": "Mysterious deaths! Unknown to the Jedi, a new threat has unleashed on the galaxy: Savage Opress, a pawn in the dangerous game between Count Dooku and his former assassin, Ventress. The victims of his brutal massacre on the planet of Devaron are being returned to the Jedi Temple for evaluation. It's up to the Jedi Council to find this mysterious killer, and eradicate him....",
    "season": 3,
    "episode": 14,
    "date": "20 BBY",
    "irl_date": "2011-01-21T00:00:00"
  },
  {
    "title": "Overlords",
    "link": "https://starwars.fandom.com/wiki/Overlords",
    "description": "A mysterious force draws Anakin, Obi-Wan, and Ahsoka to a distant planet, and its inhabitants -- a family of exceptionally powerful Force-wielders -- in an attempt to determine whether Anakin is truly the Chosen One. The patriarch of this family, known only as the Father, has spent ages maintaining the balance between his Daughter, who is strong with the light side of the Force, and his Son, who aligns with the dark. The Father reveals his days are numbered, and he seeks Anakin to take his place as the fulcrum of this balance. A test proves that Anakin is capable of controlling both offspring, as the Father does, but Skywalker refuses to take the Father's place.",
    "crawl": "Mysterious message! A transmission has been intercepted far beyond the Outer Rim, deep in the Chrelythiumn system. Why the call has been made, and from where cannot be established. But buried in the message is a Jedi distress code that has not been used in over 2,000 years. Obi-Wan Kenobi, Anakin Skywalker and his Padawan Ahsoka are sent to investigate. Fearing a Separatist trap, they are to meet with a heavily armed Jedi cruiser....",
    "season": 3,
    "episode": 15,
    "date": "20 BBY",
    "irl_date": "2011-01-28T00:00:00"
  },
  {
    "title": "Altar of Mortis (episode)",
    "link": "https://starwars.fandom.com/wiki/Altar_of_Mortis_(episode)",
    "description": "Before the Jedi can leave Mortis, the Son takes Ahsoka captive in an attempt to entice Anakin into joining him to use their combined strength to overpower his Father and Sister. To this end, the Son casts Ahsoka under the spell of the dark side.",
    "crawl": "Mystery on Mortis! Sent to discover the origin of a mysterious distress call, Obi-Wan Kenobi, Anakin Skywalker, and his Padawan Ahsoka Tano are stranded on a distant planet. There, they discover three beings more powerful with the Force than any Jedi have seen before. The Father keeps a fragile balance between his Daughter, who allies with the light side, and the Son, who drifts ever closer to the dark. With his strength failing, the Father asks Anakin to stay and take his place, preserving the balance between light and dark. But after passing a perilous test, Skywalker refuses. Now we find our heroes about to depart for their journey home, or so they think....",
    "season": 3,
    "episode": 16,
    "date": "20 BBY",
    "irl_date": "2011-02-04T00:00:00"
  },
  {
    "title": "Ghosts of Mortis",
    "link": "https://starwars.fandom.com/wiki/Ghosts_of_Mortis",
    "description": "The Jedi remain stranded on Mortis, and the Son, aligned with the dark side of the Force, renews his efforts to convert Anakin as the Jedi prepare for a decisive confrontation. Anakin is stunned by images of his dark future. The Son promises him the power to avert this destiny.",
    "crawl": "Stranded! Obi-Wan Kenobi, Anakin Skywalker, and his Padawan Ahsoka Tano are caught in the middle of a treacherous battle between good and evil. The scales now tip toward the dark side. Our three warriors must guard against attack as they plan their escape. A great weight has been placed on Anakin's shoulders, for it is now that he must face who he really is....",
    "season": 3,
    "episode": 17,
    "date": "20 BBY",
    "irl_date": "2011-02-11T00:00:00"
  },
  {
    "title": "The Citadel (episode)",
    "link": "https://starwars.fandom.com/wiki/The_Citadel_(episode)",
    "description": "With help from R2-D2 and a squad of captured battle droids, an elite team of Jedi and clone troopers led by Obi-Wan and Anakin attempt to free a captive Jedi General, Even Piell, from an impenetrable prison. Despite orders to the contrary, Ahsoka Tano tags along, though she proves indispensable when the infiltration mission begins to evolve. Piell and his fleet officer, Captain Tarkin, are liberated from their cells, but now the fugitives must escape the Citadel itself.",
    "crawl": "Captured! Returning from a perilous assignment in the Outer Rim, Jedi Master Even Piell's cruiser has fallen under attack and been boarded. Seeking vital information he carries about secret hyperspace lanes called the Nexus Route, Separatist forces have taken him alive. Now the Jedi are preparing a stealth mission into the heart of Separatist space in an effort to rescue Master Piell from the deadly prison known as the Citadel....",
    "season": 3,
    "episode": 18,
    "date": "20 BBY",
    "irl_date": "2011-02-18T00:00:00"
  },
  {
    "title": "Counterattack",
    "link": "https://starwars.fandom.com/wiki/Counterattack",
    "description": "With freed prisoners in their possession and the brutal warden attempting desperately to thwart them, Obi-Wan and Anakin search for a way out of the Citadel and back to Coruscant. The prison, however, has more traps, perils, and pitfalls in store for them than they had imagined and they must work past their differences if they are to escape. Their bid to board their shuttle fails when heavy weapons fire destroys the escape craft. ARC trooper Echo dies in the blast. The escapees then flee to the caves and call for rescue from the Jedi Temple on Coruscant.",
    "crawl": "Escape from a Separatist prison! Carrying information about secret routes into the heart of the Republic and Separatist homeworlds, Jedi Master Even Piell was captured and imprisoned in a fortress known as the Citadel. Leading an elite strike team, Obi-Wan Kenobi and Anakin Skywalker rescue Master Piell and his officers. Now the Jedi have split up to evade Separatist forces as they attempt to escape the Citadel....",
    "season": 3,
    "episode": 19,
    "date": "20 BBY",
    "irl_date": "2011-03-04T00:00:00"
  },
  {
    "title": "Citadel Rescue",
    "link": "https://starwars.fandom.com/wiki/Citadel_Rescue",
    "description": "After their ship and only way off the planet is destroyed, Anakin and Obi-Wan must lead the escaped prisoners across Lola Sayu's perilous landscape as Plo Koon commands a task force of four cruisers and their fighters through the Separatist defenses in a daring rescue. Even Piell is ravaged by anooba tracking beasts, but before he dies, he passes on his Nexus Routes coordinates to Ahsoka. When the survivors return to Coruscant, Ahsoka knows half the intel, and refuses to disclose it to anyone but the Jedi Council, while Tarkin refuses to hand over his half to anyone other than the Chancellor.",
    "crawl": "Trapped behind enemy lines! Carrying secret information vital to the Republic's war effort, Jedi Master Even Piell and Captain Tarkin were taken prisoner by the Separatists. An elite strike team led by Obi-Wan Kenobi and Anakin Skywalker landed on the planet Lola Sayu and infiltrated the prison. The team rescued Master Piell and Tarkin, but they were pursued by the prison's evil commandant, Osi Sobeck. During the escape, their ship was destroyed. Now we find them on the run, desperate to escape the trap that is the Citadel....",
    "season": 3,
    "episode": 20,
    "date": "20 BBY",
    "irl_date": "2011-03-11T00:00:00"
  },
  {
    "title": "Padawan Lost",
    "link": "https://starwars.fandom.com/wiki/Padawan_Lost",
    "description": "Ahsoka and a group of abducted younglings find themselves trapped on a Trandoshan moon, prey in an elaborate and cruel hunt. The forlorn younglings have lost all hope, despite the best efforts of their spirited leader, Kalifa. Ahsoka rallies them to defend themselves and strike back against the Trandoshan, an effort with deadly consequences.",
    "crawl": "Turmoil in the Outer Rim! Located near a major hyperspace lane, the planet Felucia is caught in an unending battle between Republic and Separatist forces. Clone tank divisions make a valiant push deep into Separatist-controlled territory, led by Anakin Skywalker and his Padawan, Ahsoka Tano. General Grievous, learning of the impending Jedi attack, has dispatched reinforcements to one of his droid outposts, hoping to secure his grip on the system....",
    "season": 3,
    "episode": 21,
    "date": "20 BBY",
    "irl_date": "2011-03-19T00:00:00"
  },
  {
    "title": "Wookiee Hunt",
    "link": "https://starwars.fandom.com/wiki/Wookiee_Hunt",
    "description": "As Ahsoka and her youngling allies struggle to evade the Trandoshan hunters, their efforts receive an unexpected boost when a new captive -- Chewbacca the Wookiee -- arrives. Chewie scrounges parts from a wrecked Trandoshan slave ship, assembling a communicator to send out a distress signal. Help arrives in the towering, shaggy form of Wookiee warriors led by General Tarfful. Freed from captivity, Ahsoka returns to the Jedi Temple and is reunited with Anakin Skywalker.",
    "crawl": "Jedi abducted! Ahsoka Tano is missing in action. Captured and released into a hostile jungle, she fights to stay alive with the help of a small band of Jedi younglings. As Anakin Skywalker scours the galaxy, desperate to find his lost apprentice, Trandoshan sport hunters track their youngling prey. With the death of their leader, Kalifa, and separated from her friends, we find Ahsoka on the run as the hunters close in around her....",
    "season": 3,
    "episode": 22,
    "date": "20 BBY",
    "irl_date": "2011-04-01T00:00:00"
  },
  {
    "title": "Water War",
    "link": "https://starwars.fandom.com/wiki/Water_War",
    "description": "\"When the king of Mon Cala is assassinated, talks break down between the Mon Calamari people and the Quarren, co-inhabitants of the aquatic world. To stop a civil war, the Republic sends Padmé Amidala and Anakin Skywalker, but unbeknownst to them, the Quarren are already being backed by the Separatists. Now the Jedi must protect Mon Cala's new leader, the young Prince Lee-Char, from the attack.\"",
    "crawl": "Water wars! Tensions run high on the ocean world of Mon Calamari, where two separate peoples, the aggressive squid-like Quarren and their peaceful neighbor, the Mon Calamari, struggle to maintain a fragile co-existence. Adding to the strife, the king of the Mon Calamari has been found mysteriously murdered, leaving his young son, Prince Lee-Char, to guide his people alone. But the Quarren race will not accept the new ruler as their king. Senator Amidala and her Jedi bodyguard have arrived to help resolve the matter and to avoid plunging the planet into civil war....",
    "season": 4,
    "episode": 1,
    "date": "20 BBY",
    "irl_date": "2011-09-16T00:00:00"
  },
  {
    "title": "Gungan Attack",
    "link": "https://starwars.fandom.com/wiki/Gungan_Attack",
    "description": "\"Anakin Skywalker and the rest of his Jedi team have been overrun by the Separatist surprise attacks led by Riff Tamson while Prince Lee-Char and Ahsoka must evade capture on their own. Unable to summon more Republic aid, Yoda calls upon the help of the powerful and amphibious Gungan Grand Army, but whether they will be enough to stop the Separatist siege is uncertain. An incensed Tamson doubles his efforts in tracking down Prince Lee-Char, unleashing the reinforcements given to him by Count Dooku in an assault that churns the oceans.\"",
    "crawl": "A government toppled by civil war! Refusing to accept Prince Lee-Char as the next ruler of Mon Cala, the Quarren people join the Separatist Alliance and launch an all-out attack on the Mon Calamari. Caught unprepared, the young Prince and his Jedi protectors are quickly overwhelmed and forced to retreat in the caves far below the capital city, leaving Count Dooku and his allies to plan their next move....",
    "season": 4,
    "episode": 2,
    "date": "20 BBY",
    "irl_date": "2011-09-16T00:00:00"
  },
  {
    "title": "Prisoners",
    "link": "https://starwars.fandom.com/wiki/Prisoners",
    "description": "\"The Republic and Gungan forces have been captured by Riff Tamson and his Karkarodon enforcers. Now, it is up to Ahsoka and the young Prince Lee-Char to unite the fractured people of Mon Cala and drive out the Separatist invaders.\"",
    "crawl": "A last gasp of hope! After the assassination of his father and the fall of his kingdom beneath a planetary civil war, Mon Cala Prince Lee-Char has gone into hiding with Padawan Ahsoka Tano as his only protector. With his armies captured and friends imprisoned, the situation seems hopeless for the Prince. Count Dooku commands his sinister agent, Riff Tamson, to use any means necessary to bring Prince Lee-Char out of hiding, for he knows that hope does remain as long as the Prince is alive....",
    "season": 4,
    "episode": 3,
    "date": "20 BBY",
    "irl_date": "2011-09-23T00:00:00"
  },
  {
    "title": "Shadow Warrior",
    "link": "https://starwars.fandom.com/wiki/Shadow_Warrior",
    "description": "\"When the leader of the Gungans, Boss Lyonie, is injured it's discovered there is an uncanny resemblance between the Boss and Jar Jar Binks. Binks must sway his people from rising against the Naboo and stopping a Separatist invasion led by General Grievous.\"",
    "crawl": "As war continues to fracture the galaxy, planets become pawns in a dangerous chess game. One planet in peril is Naboo, where suffering and civil unrest threaten once-friendly relations between the people on the surface and the underwater-dwelling Gungans. Rumors that the Gungans plan to aid the Separatists in an attack on Theed force Senator Padmé Amidala home, accompanied by Jedi General Anakin Skywalker....",
    "season": 4,
    "episode": 4,
    "date": "20 BBY",
    "irl_date": "2011-09-30T00:00:00"
  },
  {
    "title": "Mercy Mission (episode)",
    "link": "https://starwars.fandom.com/wiki/Mercy_Mission_(episode)",
    "description": "\"After groundquakes have devastated the planet Aleen, a Republic relief effort arrives, including the droids R2-D2 and C-3PO. When the native Aleena's pleas go unheard, it becomes the duty of the droids to embark on a surreal journey through Aleen's subterranean world to save the planet.\"",
    "crawl": "Global crisis! The Mid Rim planet of Aleen is devastated by catastrophic earthquakes. As the people struggle, the future of the survivors rests on their ability to rekindle their way of life from the rubble of the past. A Jedi transport, on a mission to block Separatist annexation of the Qiilura system, is waylaid to provide desperately needed humanitarian relief to the people on the surface of Aleen....",
    "season": 4,
    "episode": 5,
    "date": "20 BBY",
    "irl_date": "2011-10-07T00:00:00"
  },
  {
    "title": "Nomad Droids",
    "link": "https://starwars.fandom.com/wiki/Nomad_Droids",
    "description": "C-3PO and R2-D2's bizarre caper continues. Forced to escape a Separatist attack in a Y-wing fighter, the droids visit the world of the Patitites, the odd planet Balnab, and the inside of a pirate warship where they are forced to fight in a gladiatorial arena.",
    "crawl": "Homeward bound! On a peaceful mission on the planet Aleen, R2-D2 and C-3PO were caught up in an adventure beyond their comprehension. After finally resolving the crisis and being taken to Jedi Master Adi Gallia's cruiser, they now head home to the safety of the Republic, hoping to avoid a Separatist attack....",
    "season": 4,
    "episode": 6,
    "date": "20 BBY",
    "irl_date": "2011-10-14T00:00:00"
  },
  {
    "title": "Darkness on Umbara",
    "link": "https://starwars.fandom.com/wiki/Darkness_on_Umbara",
    "description": "\"When Anakin is forced to temporarily turn over command of his clone troopers to a new commander, the Jedi Pong Krell, tensions begin to run high as the clones are assigned with a very deadly mission to take the capital of Umbara.\"",
    "crawl": "War in the Expansion Region! As the Separatists tighten their grip over vital but isolated supply routes, the Republic launches a lightning strike into a remote Ghost Nebula to control the strategic system of Umbara. Republic forces smash through the Separatist blockade in an effort to claim the shadowy world....",
    "season": 4,
    "episode": 7,
    "date": "20 BBY",
    "irl_date": "2011-10-28T00:00:00"
  },
  {
    "title": "The General (episode)",
    "link": "https://starwars.fandom.com/wiki/The_General_(episode)",
    "description": "General Krell orders Captain Rex and the clone troopers of the 501st Legion to conquer a heavily fortified Umbaran airbase, and will not accept anything less than victory. It is an almost certain suicide mission, unless the clones can use their ingenuity to defeat their new enemy.",
    "crawl": "Turning the tide! As Separatist control over vital but isolated supply routes expands, Republic forces invade a key planet, the darkened world of Umbara. In the midst of helping Obi-Wan Kenobi's battalion conquering the Umbaran capital city, Anakin Skywalker is called away to Coruscant. His battalion is temporarily placed under the command of Jedi General Pong Krell, a shrewd and temperamental leader. Krell's reckless strategy forced Captain Rex to retreat with his platoons in a disastrous defeat....",
    "season": 4,
    "episode": 8,
    "date": "20 BBY",
    "irl_date": "2011-11-04T00:00:00"
  },
  {
    "title": "Plan of Dissent",
    "link": "https://starwars.fandom.com/wiki/Plan_of_Dissent",
    "description": "After the Republic conquers an Umbaran airbase, General Krell orders Rex and his men on towards the heavily fortified capital. Realizing there's a better plan, several clone troopers disobey orders to carry out a rogue, covert operation.",
    "crawl": "Invasion in peril! Republic forces struggle to take Umbara, a hostile planet completely enshrouded in darkness. Jedi General Pong Krell and Captain Rex lead a battalion against a constant attack by a brutal enemy. Krell's aggressive and reckless strategies backfire, killing many clones. Despite the Jedi General's dangerous tactics, Captain Rex's squad successfully captures a critical airbase. This further fuels the mistrust of Krell's leadership, dividing his men....",
    "season": 4,
    "episode": 9,
    "date": "20 BBY",
    "irl_date": "2011-11-11T00:00:00"
  },
  {
    "title": "Carnage of Krell",
    "link": "https://starwars.fandom.com/wiki/Carnage_of_Krell",
    "description": "With two of his men facing execution for disobeying orders, Captain Rex must confront his overly aggressive commander, General Krell. Risking charges of mutiny, Rex must make a dark choice as the true face of the enemy emerges.",
    "crawl": "While fighting to control  the darkened world of Umbara,  Anakin Skywalker's battalion  is temporarily placed  under the command of  Jedi General Pong Krell. As Krell's disastrous strategies  result in increasing casualties,  his men begin to turn against him.  Captain Rex struggles to  balance loyalty between his commander  and his fellow men. Under his watch,  Fives and Jesse disobey Krell's orders,  resulting in their court-martial....",
    "season": 4,
    "episode": 10,
    "date": "20 BBY",
    "irl_date": "2011-11-18T00:00:00"
  },
  {
    "title": "Kidnapped",
    "link": "https://starwars.fandom.com/wiki/Kidnapped",
    "description": "\"Zygerrian slavers are behind the sudden disappearance of an entire colony of people on the planet Kiros. As Anakin and Ahsoka rush to defuse a series of bombs planted by the slavers, Obi-Wan must fight with their imposing leader.\"",
    "crawl": "A planet of peace! The artisan colony of the planet Kiros created a society without weapons. Instead of war, they pursue art and beauty. But in the Clone Wars, even peace-loving worlds are seemingly forced to change sides....",
    "season": 4,
    "episode": 11,
    "date": "20 BBY",
    "irl_date": "2011-11-25T00:00:00"
  },
  {
    "title": "Slaves of the Republic",
    "link": "https://starwars.fandom.com/wiki/Slaves_of_the_Republic",
    "description": "\"To locate the missing colonists, Anakin, Obi-Wan, and Ahsoka go undercover to infiltrate the slavers on Zygerria. Anakin struggles with his emotions as a wily Zygerrian queen forces him to take questionable actions in order to carry out his mission.\"",
    "crawl": "Kidnapped! During a Separatist invasion of the planet Kiros, thousands of peaceful colonists are abducted by Zygerrian slavers. Determined to find the missing colonists, the Jedi travel to Zygerria, home to the galaxy's most notorious slave empire....",
    "season": 4,
    "episode": 12,
    "date": "20 BBY",
    "irl_date": "2011-12-02T00:00:00"
  },
  {
    "title": "Escape from Kadavo",
    "link": "https://starwars.fandom.com/wiki/Escape_from_Kadavo",
    "description": "\"Anakin tries to convince the Zygerrian Queen that she too is a slave and pawn in an evil Separatist plot. Meanwhile, Obi-Wan toils in the slave camps of Kadavo, a grim situation that grows increasingly bleak.\"",
    "crawl": "A people enslaved! To locate the abducted colonists of a peace-loving world, the Jedi infiltrated the slaver planet of Zygerria, only to be captured by its ambitious queen, who plots to rebuild her empire of oppression. Now, even Obi-Wan Kenobi must come to terms with a life in chains....",
    "season": 4,
    "episode": 13,
    "date": "20 BBY",
    "irl_date": "2012-01-06T00:00:00"
  },
  {
    "title": "A Friend in Need",
    "link": "https://starwars.fandom.com/wiki/A_Friend_in_Need",
    "description": "\"A peace conference between Separatists and Republic delegates is interrupted by Lux Bonteri, the son of a late Separatist Senator, who involves Ahsoka in his dangerous search to find justice for his mother's death.\"",
    "crawl": "Divided by war! In an effort to end the galactic conflict, the first ever sanctioned meeting between the Republic and the Separatists will be held and Mandalore is chosen as neutral ground for these precarious meetings. Tensions run high as many hold hope for these important negotiations....",
    "season": 4,
    "episode": 14,
    "date": "20 BBY",
    "irl_date": "2012-01-13T00:00:00"
  },
  {
    "title": "Deception",
    "link": "https://starwars.fandom.com/wiki/Deception",
    "description": "\"When the Jedi learn of a Separatist plot to kidnap Chancellor Palpatine, one of them must go deep undercover as a hardened criminal to extract information from the conspirators.\"",
    "crawl": "A terrorist threat! Moralo Eval, mastermind of a Separatist plot to kidnap Chancellor Palpatine, has been captured by Republic forces. But even with the criminal behind bars, rumors swirl in the underworld of Coruscant that Moralo's plot has already been set in motion. With precious time running out, the Jedi Council hatches their own plot to keep the Chancellor safe....",
    "season": 4,
    "episode": 15,
    "date": "20 BBY",
    "irl_date": "2012-01-20T00:00:00"
  },
  {
    "title": "Friends and Enemies",
    "link": "https://starwars.fandom.com/wiki/Friends_and_Enemies",
    "description": "\"Fleeing across the galaxy with criminal fugitives, a disguised Obi-Wan, Cad Bane, and Moralo Eval are tenaciously pursued by Anakin and Ahsoka, who have no idea they're chasing their friend.\"",
    "crawl": "Fugitives on the run! Disguised as Jedi killer Rako Hardeen, Obi-Wan Kenobi works undercover to solve a Separatist plot against Chancellor Palpatine. Obi-Wan meets the plot's mastermind, Moralo Eval, breaking him out of jail to gain his trust. But now Kenobi faces another obstacle: bounty hunter Cad Bane. Can Obi-Wan Kenobi overcome Bane's suspicions? Or will the ruthless criminal see through his disguise and expose the Jedi? Only time will tell....",
    "season": 4,
    "episode": 16,
    "date": "20 BBY",
    "irl_date": "2012-01-27T00:00:00"
  },
  {
    "title": "The Box",
    "link": "https://starwars.fandom.com/wiki/The_Box",
    "description": "The disguised Obi-Wan accompanies Cad Bane and Moralo Eval to Serenno, where they enlist in a brutal competition with other bounty hunters from around the galaxy to determine who will participate in a plot to kidnap the Chancellor.",
    "crawl": "Obi-Wan Kenobi in disguise! Working undercover as assassin Rako Hardeen, Obi-Wan leads a secret mission to uncover the Separatist plot against Chancellor Palpatine. Using cunning and courage, he gains the trust of bounty hunter Cad Bane and criminal mastermind Moralo Eval, earning him entrance into the stronghold of Separatist leader, Count Dooku. Now, it is here, on the beautiful planet of Serenno, that a barbaric contest will determine the fate of Obi-Wan Kenobi and possibly the Republic itself....",
    "season": 4,
    "episode": 17,
    "date": "20 BBY",
    "irl_date": "2012-02-03T00:00:00"
  },
  {
    "title": "Crisis on Naboo",
    "link": "https://starwars.fandom.com/wiki/Crisis_on_Naboo",
    "description": "\"The Chancellor travels to Naboo to preside over a public ceremony, guarded by Jedi Knights. Dooku and his bounty hunters—including an undercover Obi-Wan Kenobi—launch their kidnapping plot.\"",
    "crawl": "Supreme Chancellor in peril! After surviving the ordeals of the Box, Obi-Wan Kenobi -- working undercover as assassin Rako Hardeen -- is invited to join Count Dooku's plot against Chancellor Palpatine. Working with a team of deadly bounty hunters, Obi-Wan travels to the planet of Naboo, where the Chancellor will preside over the Festival of Light. Now, as the Jedi Council and Count Dooku finalize their respective plans, a deadly confrontation seems inevitable....",
    "season": 4,
    "episode": 18,
    "date": "20 BBY",
    "irl_date": "2012-02-10T00:00:00"
  },
  {
    "title": "Massacre",
    "link": "https://starwars.fandom.com/wiki/Massacre",
    "description": "\"Count Dooku is determined to have revenge against the Nightsisters of Dathomir after their betrayal. General Grievous launches an all-out droid attack against the magic-wielding witches, and Mother Talzin and Asajj Ventress lead the defense with all the dark powers at their command.\"",
    "crawl": "Sinister forces on the move! Asajj Ventress has suffered a humiliating betrayal at the hands of her own assassin, Savage Opress. Having gone into hiding, she now has no choice but to seek sanctuary with the Nightsisters of Dathomir....",
    "season": 4,
    "episode": 19,
    "date": "20 BBY",
    "irl_date": "2012-02-24T00:00:00"
  },
  {
    "title": "Bounty (episode)",
    "link": "https://starwars.fandom.com/wiki/Bounty_(episode)",
    "description": "\"An aimless Asajj Ventress joins a team of bounty hunters under the leadership of young Boba Fett. On an alien world, they undertake a dangerous but profitable mission that tests the limits of their skills, and the strength of Asajj's character.\"",
    "crawl": "Abandoned! After an assassination attempt by his forsaken apprentice, Asajj Ventress, Count Dooku launches a brutal counterattack against the Nightsisters, massacring the entire clan. Forced into exile, Ventress wanders far into the Outer Rim, among the castaways and vagabonds of the galaxy, seeking her new life that was foretold by Mother Talzin....",
    "season": 4,
    "episode": 20,
    "date": "20 BBY",
    "irl_date": "2012-03-02T00:00:00"
  },
  {
    "title": "Brothers (episode)",
    "link": "https://starwars.fandom.com/wiki/Brothers_(episode)",
    "description": "\"The dark warrior Savage Opress is on a quest to find his long-lost brother. Could Darth Maul truly be alive, after more than a decade since his gruesome bisection at the blade of Obi-Wan Kenobi? Savage voyages into the depths of a twisted planet to find whatever became of the fallen Sith Lord.\"",
    "crawl": "A darkness awakes! Count Dooku's bitter betrayal of his former apprentice Asajj Ventress resulted in the creation of a new menace in the galaxy: Savage Opress. Caught in a deadly game of revenge between Ventress and Dooku, Savage barely escaped the carnage. Beaten and alone, he returned to Mother Talzin, his creator, who gave him a new quest: to pursue his long-lost brother....",
    "season": 4,
    "episode": 21,
    "date": "20 BBY",
    "irl_date": "2012-03-09T00:00:00"
  },
  {
    "title": "Revenge (episode)",
    "link": "https://starwars.fandom.com/wiki/Revenge_(episode)",
    "description": "\"Savage and Maul, now reunited, pursue Obi-Wan Kenobi in search of revenge, and the Jedi Knight finds himself forced to unite with a surprising ally to defend against the deadly siblings.\"",
    "crawl": "Brothers reunited! Darth Maul, the sinister Sith thought to have been destroyed so many years ago by Jedi Master Obi-Wan Kenobi, was found alive by his brother, Savage Opress, and taken back to Mother Talzin on Dathomir. Though Darth Maul's memory has yet to be fully restored, his need for vengeance has awakened, more powerful than ever....",
    "season": 4,
    "episode": 22,
    "date": "20 BBY",
    "irl_date": "2012-03-16T00:00:00"
  },
  {
    "title": "Revival (episode)",
    "link": "https://starwars.fandom.com/wiki/Revival_(episode)",
    "description": "\"Fueled by vengeance and rage, the newly reunited brothers Savage Opress and Maul spread terror and violence across the galaxy. As the Sith brothers forcibly recruit Hondo Ohnaka and his pirates, Obi-Wan Kenobi and Adi Gallia chase them down, leading to a deadly confrontation.\"",
    "crawl": "Death and destruction! Darth Maul and Savage Opress spread chaos as they descend on the Outer Rim. After rescuing his brother from despair, Savage and Maul murder and pillage at every turn. Fueled by rage and vengeance, they search for meaning in their new alliance as reports of their brutal attacks spread across the galaxy....",
    "season": 5,
    "episode": 1,
    "date": "19 BBY",
    "irl_date": "2012-08-24T00:00:00"
  },
  {
    "title": "A War on Two Fronts",
    "link": "https://starwars.fandom.com/wiki/A_War_on_Two_Fronts",
    "description": "\"Anakin, Obi-Wan, Ahsoka, and Rex travel to Onderon, a world under Separatist control. There, they will train a group of insurgent rebels—including Lux Bonteri—to help take back the capital city of Iziz from the rule of a duplicitous king.\"",
    "crawl": "Separatist takeover complete! Another Republic planet has fallen. Onderon has seceded to the Confederacy of Independent Systems under the rule of a new king. However, a small band of rebels have taken refuge deep within the vast and savage wilderness. From an abandoned outpost, they plot to take back the heavily fortified capital city of Iziz and end the Separatist occupation....",
    "season": 5,
    "episode": 2,
    "date": "20 BBY",
    "irl_date": "2012-10-06T00:00:00"
  },
  {
    "title": "Front Runners",
    "link": "https://starwars.fandom.com/wiki/Front_Runners",
    "description": "\"Supervised by Ahsoka, the Onderon rebels infiltrate the capital and carry out a series of strikes on targets throughout the city. As the Separatist-aligned king comes under increasing pressure to deal with the growing rebellion, the rebels choose a new leader.\"",
    "crawl": "Jedi form rebel alliance! Led by Anakin Skywalker, the Jedi have trained a band of rebels to fight the Separatists on the planet Onderon. With the help of the Jedi, the rebels escaped capture and infiltrated the heavily fortified city of Iziz. Now our heroes have launched an armed campaign to subvert the Separatist occupation of the planet. The Jedi Council continue to observe and advise as the rebels strive to gain momentum against the Separatist forces. Despite the absence of civilian casualties, public fear has ensued as reports of the rebels' daring strikes circulate throughout the city....",
    "season": 5,
    "episode": 3,
    "date": "20 BBY",
    "irl_date": "2012-10-13T00:00:00"
  },
  {
    "title": "The Soft War",
    "link": "https://starwars.fandom.com/wiki/The_Soft_War",
    "description": "\"After a rebel attempt to rescue Onderon's true king, Ramsis Dendup, an unexpected ally steps forward to halt Dendup's execution and aid the rebel cause.\"",
    "crawl": "The rebels elect a new leader! With their training complete, Obi-Wan and Anakin have left Ahsoka on Onderon to monitor and advise the rebels as they continue to strike Separatist targets under the command of Steela Gerrera. Facing an escalation of rebel attacks, the Separatists have sent reinforcements to straighten their hold on the city of Iziz as the battle for the planet unfolds...",
    "season": 5,
    "episode": 4,
    "date": "20 BBY",
    "irl_date": "2012-10-20T00:00:00"
  },
  {
    "title": "Tipping Points",
    "link": "https://starwars.fandom.com/wiki/Tipping_Points",
    "description": "\"As a full-scale revolt embroils Onderon, the rebels strike a decisive blow against the planet's Separatist-aligned king. Unfortunately for the rebels, such victory comes at a high price.\"",
    "crawl": "War in the Inner Rim! Rebel leader Steela Gerrera has joined forces with General Tandin after boldly rescuing Onderon's former king from execution, evading a trap set by Separatist ally King Rash and the droid general Kalani. Amid growing public support and rising unrest, Ahsoka continues to monitor the rebels' efforts as they rally around Ramsis Dendup to restore his reign as the rightful king and finally put an end to the Separatist occupation of Onderon....",
    "season": 5,
    "episode": 5,
    "date": "20 BBY",
    "irl_date": "2012-10-27T00:00:00"
  },
  {
    "title": "The Gathering (episode)",
    "link": "https://starwars.fandom.com/wiki/The_Gathering_(episode)",
    "description": "\"Ahsoka escorts a group of younglings to Ilum, where they will learn from Yoda and undergo a crucial rite of passage: the construction of their lightsabers. They grapple with both physical and inner challenges as they face the dangerous task ahead of them.\"",
    "crawl": "As the Clone War scorches its destructive path across the galaxy, it is the Jedi who bring order to the chaos. Though as the war progresses, the number of Jedi have declined, and new younglings are harder to find. When a youngling is located, they are brought to the Jedi Temple and learn quickly that their true family is now the Jedi Order. The trials are hard. Tests must be passed. But none is as important as The Gathering. It is then that a Jedi's path will truly begin....",
    "season": 5,
    "episode": 6,
    "date": "20 BBY",
    "irl_date": "2012-11-03T00:00:00"
  },
  {
    "title": "A Test of Strength",
    "link": "https://starwars.fandom.com/wiki/A_Test_of_Strength",
    "description": "\"As the younglings return from Ilum with Ahsoka, their ship comes under attack by Hondo's gang of pirates. The children must use ingenious and improvised traps to thwart the brigands.\"",
    "crawl": "Ancient Jedi tradition! Six younglings are sent to the secret caverns of Ilum, where they are tested by the Gathering, an ancient Jedi ritual where each youngling must harvest a crystal around which they will construct their own lightsaber. Along the journey, they underwent great perils, hardest of which was to face themselves. Now, having passed the test, they take their first steps into a larger world....",
    "season": 5,
    "episode": 7,
    "date": "20 BBY",
    "irl_date": "2012-11-10T00:00:00"
  },
  {
    "title": "Bound for Rescue",
    "link": "https://starwars.fandom.com/wiki/Bound_for_Rescue",
    "description": "\"With Ahsoka captured by Hondo's pirates, the younglings work together to infiltrate the pirates' den, using their wits and courage to deceive Hondo Ohnaka and launch a daring rescue.\"",
    "crawl": "Piracy in deep space! Infamous outlaw Hondo Ohnaka attacks a Jedi transport bearng six younglings who just received their lightsaber crystals. So rare are these crystals, that Hondo knows he can sell them on the black market for a small fortune. In a desperate attempt to save the younglings, Ahsoka Tano is captured by Hondo and his pirate horde. Now, with a damaged ship, the younglings are stranded and alone....",
    "season": 5,
    "episode": 8,
    "date": "20 BBY",
    "irl_date": "2012-11-17T00:00:00"
  },
  {
    "title": "A Necessary Bond",
    "link": "https://starwars.fandom.com/wiki/A_Necessary_Bond",
    "description": "\"When General Grievous launches a full-scale attack on the pirate base on Florrum, Ahsoka and the younglings fight side-by-side with Hondo and his pirates to turn back the Separatist forces.\"",
    "crawl": "Pursued by pirates! While on a rite of passage, six Jedi younglings and Ahsoka Tano are ambushed. While protecting the young Jedi, Ahsoka was captured by the nefarious Hondo Ohnaka and taken to the planet Florrum. Marshalling their courage and training, the younglings infiltrated the pirate stronghold and rescued Ahsoka. Now we find our heroes in a race to their starship, with the pirates closing in....",
    "season": 5,
    "episode": 9,
    "date": "20 BBY",
    "irl_date": "2012-11-24T00:00:00"
  },
  {
    "title": "Secret Weapons",
    "link": "https://starwars.fandom.com/wiki/Secret_Weapons",
    "description": "\"R2-D2 is part of a team of Republic droids chosen for an important mission led by the diminutive Colonel Gascon to obtain an encryption module from a Separatist dreadnought. The droids must overcome numerous challenging obstacles to succeed in this crucial assignment.\"",
    "crawl": "Secret transmission intercepted! The Jedi Council has intercepted an encoded transmission of General Grievous; however, Republican intelligence officers have failed to crack the new encryption code being used by the droids. Fears escalate that the Separatists are about to mount a major offensive. Having located the source of the transmission deep in Separatist space, the Jedi plan a counterstrike to capture an enemy decoding chip which will allow them to understand the transmission and thwart the Separatist plot....",
    "season": 5,
    "episode": 10,
    "date": "20 BBY",
    "irl_date": "2012-12-01T00:00:00"
  },
  {
    "title": "A Sunny Day in the Void",
    "link": "https://starwars.fandom.com/wiki/A_Sunny_Day_in_the_Void",
    "description": "\"After a comet damages their shuttle, R2-D2, Colonel Gascon, and the other droids crash on a desolate planet where they must make their way across a bewildering expanse of emptiness to carry out their mission.\"",
    "crawl": "Secret weapons! The Jedi Council deploys a squad of droids on a desperate mission aboard a Separatist cruiser. Under the guidance of Colonel Meebur Gascon, the droids succeed in stealing a crucial encryption module. Now the Colonel and his droids squad must return the module to the Jedi Temple to crack a Separatist code detailing an impending terror plot against the Republic....",
    "season": 5,
    "episode": 11,
    "date": "20 BBY",
    "irl_date": "2012-12-08T00:00:00"
  },
  {
    "title": "Missing in Action",
    "link": "https://starwars.fandom.com/wiki/Missing_in_Action",
    "description": "\"In a nearly vacant town, R2-D2 and his team find a clone commando suffering from amnesia.\"",
    "crawl": "Stranded! On a secret mission for the Republic, Colonel Gascon and his intrepid droid squad successfully steal an encryption module from a Separatist ship. During their escape, our heroes crash on the Outer Rim planet of Abafar and find themselves stranded in the strange wasteland called The Void. Now, after surviving against all odds, our heroes must find a way home and deliver the encryption module to crack the Separatist code and stop an enemy attack....",
    "season": 5,
    "episode": 12,
    "date": "20 BBY",
    "irl_date": "2013-01-05T00:00:00"
  },
  {
    "title": "Point of No Return (The Clone Wars)",
    "link": "https://starwars.fandom.com/wiki/Point_of_No_Return_(The_Clone_Wars)",
    "description": "\"R2-D2 and his team must stop a sabotaged Jedi cruiser from destroying a crucial Republic conference.\"",
    "crawl": "Mission accomplished! Colonel Gascon and his droid squad steal an encryption module needed to crack a Separatist code and stop an impending attack on the Republic. After surviving The Void and escaping the hostile planet of Abafar, our heroes finally appear to be headed in the right direction.....",
    "season": 5,
    "episode": 13,
    "date": "20 BBY",
    "irl_date": "2013-01-12T00:00:00"
  },
  {
    "title": "Eminence (episode)",
    "link": "https://starwars.fandom.com/wiki/Eminence_(episode)",
    "description": "\"Savage and Maul form an alliance with the Death Watch to target a common enemy: Obi-Wan Kenobi.\"",
    "crawl": "Evil alliance! Darth Maul and Savage Opress escape Obi-Wan Kenobi's assault once again. With their plan to build a crime organization in peril, the brothers' fate is about to be changed forever as they drift barely alive, through unknown space.....",
    "season": 5,
    "episode": 14,
    "date": "19 BBY",
    "irl_date": "2013-01-19T00:00:00"
  },
  {
    "title": "Shades of Reason",
    "link": "https://starwars.fandom.com/wiki/Shades_of_Reason",
    "description": "\"Backed by the criminal underworld, the Sith and Death Watch launch an attack on Mandalore.\"",
    "crawl": "Villainy swells! With an army of the galaxy's most vicious criminals, Darth Maul and Savage Opress conspire with Pre Vizsla and the Death Watch to topple Duchess Satine, ruler of Mandalore. While the conspirators prepare to attack the Mandalorian capital Sundari from a base on Zanbar, the fate of 2,000 other neutral systems is under threat as Darth Maul moves closer to establishing a vast criminal empire....",
    "season": 5,
    "episode": 15,
    "date": "19 BBY",
    "irl_date": "2013-01-26T00:00:00"
  },
  {
    "title": "The Lawless",
    "link": "https://starwars.fandom.com/wiki/The_Lawless",
    "description": "\"Using Duchess Satine as bait, Darth Maul lures Obi-Wan into a trap.\"",
    "crawl": "Neutral star systems in peril! Darth Maul and Savage Opress command the planet Mandalore through the puppet Prime Minister, Almec, while they expand their criminal enterprise. With the Death Watch removed from power, and the Jedi unaware of the villainous plot, nothing stands in the way of Darth Maul's vision for a vast criminal empire. We now find Duchess Satine imprisoned, as her few remaining loyal subjects make a desperate attempt to rescue her....",
    "season": 5,
    "episode": 16,
    "date": "19 BBY",
    "irl_date": "2013-02-02T00:00:00"
  },
  {
    "title": "Sabotage (episode)",
    "link": "https://starwars.fandom.com/wiki/Sabotage_(episode)",
    "description": "\"Anakin and Ahsoka investigate a deadly bombing at the Jedi Temple.\"",
    "crawl": "Invasion! The planet Cato Neimoidia is under Separatist attack. Anakin Skywalker and his Padawan, Ahsoka Tano, rush to the rescue as they lead a squadron of starfighters to the planet below....",
    "season": 5,
    "episode": 17,
    "date": "19 BBY",
    "irl_date": "2013-02-09T00:00:00"
  },
  {
    "title": "The Jedi Who Knew Too Much",
    "link": "https://starwars.fandom.com/wiki/The_Jedi_Who_Knew_Too_Much",
    "description": "\"As the Republic military takes over the Temple bombing case, Ahsoka finds herself at odds with Admiral Tarkin.\"",
    "crawl": "Terror at the Temple! The Jedi Temple is in disarray after a vicious terrorist attack. Anakin Skywalker and Ahsoka Tano set out to find the truth of who was really behind this horrendous catastrophe. Their investigation led them to discover the true saboteur, Letta Turmond. Now the Jedi attempt to return the Temple to normalcy. But first, Master Yoda must give a eulogy to the fallen Jedi warriors....",
    "season": 5,
    "episode": 18,
    "date": "19 BBY",
    "irl_date": "2013-02-16T00:00:00"
  },
  {
    "title": "To Catch a Jedi",
    "link": "https://starwars.fandom.com/wiki/To_Catch_a_Jedi",
    "description": "\"The fugitive Ahsoka escapes to the criminal depths of Coruscant.\"",
    "crawl": "Ahsoka Tano on the run! After an attack on the Jedi Temple, Anakin Skywalker's young Padawan found herself accused of murdering the person responsible for the bombings. With no choice but to run, she was chased by her Master, who begged her to turn herself in. Knowing there is little hope of being cleared of the crimes, Ahsoka decided to find out the truth and prove her innocence on her own....",
    "season": 5,
    "episode": 19,
    "date": "19 BBY",
    "irl_date": "2013-02-23T00:00:00"
  },
  {
    "title": "The Wrong Jedi",
    "link": "https://starwars.fandom.com/wiki/The_Wrong_Jedi",
    "description": "\"On trial for murder, Ahsoka faces her greatest challenge.\"",
    "crawl": "Ahsoka Tano captured! While on the run to prove her innocence, Padawan Tano teamed up with the deadly Asajj Ventress to find the rogue Jedi who framed Ahsoka for murder. The Jedi Council sent Anakin Skywalker and Master Plo Koon to track Ahsoka down and bring her back to the Temple. Now captured and imprisoned, Ahsoka faces punishment for crimes she did not commit....",
    "season": 5,
    "episode": 20,
    "date": "19 BBY",
    "irl_date": "2013-03-02T00:00:00"
  },
  {
    "title": "The Unknown",
    "link": "https://starwars.fandom.com/wiki/The_Unknown",
    "description": "\"Clone trooper Tup succumbs to a mysterious mental illness that results in the shocking death of a Jedi Master. Unable to account for his murderous actions, Tup is sedated and sent back to Kamino for examination. Anakin and ARC trooper Fives accompany Tup, but their return trip is ambushed by Separatists.\"",
    "crawl": "Battle for Ringo Vinda! Republic forces are locked in heated combat with the droid armada on a massive space station that encircles an entire planet. Anakin Skywalker valiantly leads his men against the onslaught, which has lasted several rotations with neither side gaining any ground. Aided by the twin sister Jedi Masters Tiplee and Tiplar, the Republic now mounts a desperate offensive to break the deadlock....",
    "season": 6,
    "episode": 1,
    "date": "19 BBY",
    "irl_date": "2014-03-07T00:00:00"
  },
  {
    "title": "Conspiracy",
    "link": "https://starwars.fandom.com/wiki/Conspiracy",
    "description": "\"In the sterile laboratories of Kamino, the ailing clone trooper Tup and his friend Fives are quarantined for examination following Tup's shocking murder of a Jedi Master. With the help of medical droid AZI-3, Fives is determined to get to the bottom of Tup's condition and uncovers a secret deep within the Republic cloning program.\"",
    "crawl": "A flaw in the plan! While in the middle of a heated battle, clone trooper Tup lost his senses and killed a Jedi General. Seeming to have no awareness of his actions, Tup's health began to deteriorate rapidly. Fearing the illness was linked to a Separatist plot, Anakin Skywalker has dispatched Captain Rex and ARC Trooper 5555 to escort Tup back to the cloning facilities on Kamino for an intensive evaluation....",
    "season": 6,
    "episode": 2,
    "date": "19 BBY",
    "irl_date": "2014-03-07T00:00:00"
  },
  {
    "title": "Fugitive",
    "link": "https://starwars.fandom.com/wiki/Fugitive",
    "description": "\"Clone trooper Tup is scheduled for transport to Coruscant, where the Supreme Chancellor's own doctors will closely examine him. Fives breaks protocol and defies orders to dig up answers, and discovers that there is an organic construct of unknown purpose hidden in the brains of all clone troopers.\"",
    "crawl": "Cause of death: unknown. Kaminoan doctor Nala Se was unable to find the cause of an illness in clone trooper Tup. In a desperate attempt to save his friend's life, Fives located and removed a tumor from Tup's brain, with the help of medical droid AZI-3. Immediately following the procedure, Tup died, and Fives was placed under arrest. Now the tumor is the only hope for finding answers to Tup's mysterious illness....",
    "season": 6,
    "episode": 3,
    "date": "19 BBY",
    "irl_date": "2014-03-07T00:00:00"
  },
  {
    "title": "Orders (episode)",
    "link": "https://starwars.fandom.com/wiki/Orders_(episode)",
    "description": "\"Fives continues to push for answers regarding the mystery of the clone contamination and secures an audience with Supreme Chancellor Palpatine. But the situation quickly collapses when Fives is accused of attacking the chancellor, and he must flee deep into the Coruscant cityscape while pursued by his fellow clone troopers.\"",
    "crawl": "Clone crisis! After the mysterious death of his friend Tup, ARC trooper Fives embarked on an investigation, which led to the discovery of a hidden chip which is placed inside clone troopers when they are still embryos. The Kaminoan scientist Nala Se claims the chip is harmless, and is meant to restrain the clones from violent, unpredictable action. Fives claims otherwise, and has convinced Jedi Master Shaak Ti to allow him to plead his case directly to Supreme Chancellor Palpatine on Coruscant....",
    "season": 6,
    "episode": 4,
    "date": "19 BBY",
    "irl_date": "2014-03-07T00:00:00"
  },
  {
    "title": "An Old Friend",
    "link": "https://starwars.fandom.com/wiki/An_Old_Friend",
    "description": "\"While on Scipio to fund a mercy mission, Padmé Amidala is called upon by an old friend, Rush Clovis, to help uncover corruption in the Banking Clan. They must evade the bounty hunter Embo to escape the planet with the incriminating information.\"",
    "crawl": "As the war between the Republic and the Separatists intensifies, many are driven from their home planets, and it is up to Senator Amidala to secure aid for them. All eyes turn to the Banking Clan and the planet Scipio. In an effort to remain independent from the Republic and the Separatists, all operations are divided, and money transactions are performed in a neutral zone surrouding the main vault. For operations to continue, there must be no war on Scipio. However, worry about the stability of the Banking Clan is brewing within the Republic as the wellspring of money may be in jeopardy....",
    "season": 6,
    "episode": 5,
    "date": "19 BBY",
    "irl_date": "2014-03-07T00:00:00"
  },
  {
    "title": "The Rise of Clovis",
    "link": "https://starwars.fandom.com/wiki/The_Rise_of_Clovis",
    "description": "\"Back on Coruscant, Clovis—known traitor of the Republic—makes a dubious deal which puts him at the head of the Banking Clan. Anakin's increasing distrust and hatred of Clovis strains his relationship with Padmé to breaking point.\"",
    "crawl": "War profiteers! In times of war, credits are the fuel that fund all operations. Senator Amidala is sent to Scipio to resolve matters between the Republic and the InterGalactic Banking Clan. Here she is reunited with Rush Clovis – a once-close friend, but now a known traitor to the Republic. When Clovis reveals corruption at the core of the Banking Clan, Senator Amidala helps him steal vital files that may uncover the full extent of the plot. Anakin Skywalker is sent to rescue the Senator, and escort the information back to Coruscant, leaving the Banking Clan in chaos....",
    "season": 6,
    "episode": 6,
    "date": "19 BBY",
    "irl_date": "2014-03-07T00:00:00"
  },
  {
    "title": "Crisis at the Heart",
    "link": "https://starwars.fandom.com/wiki/Crisis_at_the_Heart",
    "description": "\"After making a deal with Count Dooku to resuscitate the ailing Banking Clan, Clovis finds himself a pawn in Dooku's designs. Clovis has brought the war to Scipio, forcing the Republic to intervene.\"",
    "crawl": "Corruption discovered at the core of the Banking Clan! Reunited, Rush Clovis and Senator Amidala discover the full extent of the deception. Anakin Skywalker is sent to the rescue – he refuses to trust Clovis, and asks Padmé not to work with him. Determined to save the banks, she refuses her husband's request, throwing their relationship into turmoil. Voted for by both the Separatists and the Republic, Clovis is elected new leader of the Galactic Banking Clan. Now all attention is focused on Scipio, as the important transfer of power begins....",
    "season": 6,
    "episode": 7,
    "date": "19 BBY",
    "irl_date": "2014-03-07T00:00:00"
  },
  {
    "title": "The Disappeared, Part I",
    "link": "https://starwars.fandom.com/wiki/The_Disappeared,_Part_I",
    "description": "\"The peaceful world of Bardotta and its mystic ways are threatened by an ancient prophecy, and its top spiritual leaders have vanished. Queen Julia of Bardotta calls for help from her most trusted friend in the Senate, Jar Jar Binks. Recognizing the importance of Bardotta's spiritual balance, the Jedi Council sends Mace Windu to accompany Binks and investigate.\"",
    "crawl": "Mystery on Bardotta! An oasis of peace during the Clone Wars, the galaxy-wide conflict now threatens the ancient ways of the Bardottan people. With their spiritual leaders mysteriously vanishing, the foundations of order in its system are near collapse. In desperation, the Queen of Bardotta has called upon the Republic Senate with a puzzling request – to help save her people from certain doom....",
    "season": 6,
    "episode": 8,
    "date": "19 BBY",
    "irl_date": "2014-03-07T00:00:00"
  },
  {
    "title": "The Disappeared, Part II",
    "link": "https://starwars.fandom.com/wiki/The_Disappeared,_Part_II",
    "description": "\"Jar Jar Binks' beloved Queen Julia of the planet Bardotta has been abducted by the bloodthirsty Frangawl Cult to fulfill a dark and ancient prophecy. Representative Binks and Jedi Master Mace Windu must find the missing Queen before the cult can rise in power.\"",
    "crawl": "Lost! Queen Julia of the planet Bardotta has been abducted. If Representative Jar Jar Binks and Jedi Master Mace Windu cannot find the missing queen in three rotations, a sinister prophecy will be fulfilled. The bloodthirsty Frangawl Cult will take over the Bardottan government, and its planetary system will be overwhelmed with chaos, death and destruction....",
    "season": 6,
    "episode": 9,
    "date": "19 BBY",
    "irl_date": "2014-03-07T00:00:00"
  },
  {
    "title": "The Lost One",
    "link": "https://starwars.fandom.com/wiki/The_Lost_One",
    "description": "\"A Jedi mission finds a lightsaber belonging to the long-dead Master Sifo-Dyas, prompting Yoda, Obi-Wan Kenobi, and Anakin Skywalker to begin an investigation into his decade-old disappearance. This sparks Darth Sidious to order Darth Tyranus to clean up any loose ends that may lead the Jedi to discover the truth of the Sith conspiracy.\"",
    "crawl": "A long-awaited truth! A distress signal has been received at the Jedi Temple, and Master Plo Koon has been dispatched to investigate its origin. The signal is from a ship thought to be lost and was last known to be in the possession of a Jedi Master who was killed long ago....",
    "season": 6,
    "episode": 10,
    "date": "19 BBY",
    "irl_date": "2014-03-07T00:00:00"
  },
  {
    "title": "Voices",
    "link": "https://starwars.fandom.com/wiki/Voices",
    "description": "\"Yoda is deeply unsettled when he hears a voice from beyond the grave: the voice of Qui-Gon Jinn. Knowing that it is impossible for a Jedi to retain his identity after Death, the Jedi Council begins to worry that Yoda may be corrupted by the influence of the dark side. Determined to find answers, Yoda escapes the Jedi Temple to follow the disembodied voice.\"",
    "crawl": "Jedi mystery! A lightsaber was found on the moon of Oba Diah, belonging to Sifo-Dyas, the Jedi responsible for the creation of the clone army. The Jedi have learned that before the start of the war Count Dooku murdered Sifo-Dyas and skillfully manipulated the Republic into the galactic conflict intending for the Jedi to fight with the clones at their side. Now, as the Jedi Council meets to discuss the purpose of this deception, Master Yoda meditates deep into the Force in search of answers.",
    "season": 6,
    "episode": 11,
    "date": "19 BBY",
    "irl_date": "2014-03-07T00:00:00"
  },
  {
    "title": "Destiny (The Clone Wars)",
    "link": "https://starwars.fandom.com/wiki/Destiny_(The_Clone_Wars)",
    "description": "\"Letting the Force guide him, Yoda voyages into the heart of the galaxy to an ancient world that is one of the wellsprings of the Force and the source of midi-chlorians. Yoda undergoes difficult trials administered by the Five Priestesses, mysterious Force-wielders who hold the secret to immortality.\"",
    "crawl": "Blinded by the dark side! The Jedi Council has begun to unravel the mystery of how the clone army was created, and now fear the Sith Lord, Count Dooku was behind it. Master Yoda searches for answers, and during deep meditation, he is able to contact the spirit of Qui-Gon Jinn, who reveals to Yoda that he must manifest his consciousness after death if he is to preserve the Jedi Order. Now, we find Master Yoda deep in space searching for a path to ones who will teach him all he does not know of the Force....",
    "season": 6,
    "episode": 12,
    "date": "19 BBY",
    "irl_date": "2014-03-07T00:00:00"
  },
  {
    "title": "Sacrifice (episode)",
    "link": "https://starwars.fandom.com/wiki/Sacrifice_(episode)",
    "description": "\"After many grueling trials, Yoda next travels to the ancient Sith homeworld of Moraband, where he must face an ancient evil determined to rule the galaxy.\"",
    "crawl": "Darkness on Dagobah! All attention is focused on Yoda, who claims to hear the voice of a long dead Jedi. Convinced that he is guarded by Qui-Gon Jinn, he finds five priestesses, who will teach him how to manifest conciousness after death. After many trials, Yoda travels to Moraband, ancient home planet of the Sith. For now, he must face the true evil that may be his undoing; and one that seeks to control the galaxy....",
    "season": 6,
    "episode": 13,
    "date": "19 BBY",
    "irl_date": "2014-03-07T00:00:00"
  },
  {
    "title": "The Bad Batch (episode)",
    "link": "https://starwars.fandom.com/wiki/The_Bad_Batch_(episode)",
    "description": "Captain Rex and the Bad Batch must infiltrate an enemy base on Anaxes.",
    "crawl": "The battle for Anaxes! One of the Republic's largest shipyards is under attack from Admiral Trench's Separatist forces. Jedi Generals Mace Windu and Anakin Skywalker lead a two-pronged assault on the ground and in the air. But after weeks of heated battle and mounting losses, the Republic's grip on Anaxes begins to slip away....",
    "season": 7,
    "episode": 1,
    "date": "19 BBY",
    "irl_date": "2020-02-21T00:00:00"
  },
  {
    "title": "A Distant Echo",
    "link": "https://starwars.fandom.com/wiki/A_Distant_Echo",
    "description": "",
    "crawl": "Conspiracy! After repeated setbacks on the planet Anaxes, an elite clone squad is deployed to investigate the Separatist tactical advantage. This special unit, called the Bad Batch, infiltrates Admiral Trench's cyber center to steal a strategic algorithm capable of predicting the Republic's every move. What our heroes found was a live signal from the ARC trooper known as Echo, a clone long believed to be dead....",
    "season": 7,
    "episode": 2,
    "date": "19 BBY",
    "irl_date": "2020-02-28T00:00:00"
  },
  {
    "title": "On the Wings of Keeradaks",
    "link": "https://starwars.fandom.com/wiki/On_the_Wings_of_Keeradaks",
    "description": "",
    "crawl": "Trapped! On an unsanctioned mission to rescue ARC trooper Echo, General Skywalker, Captain Rex, and the Bad Batch travel to Skako Minor, headquarters of the Techno Union. After a harrowing encounter with the natives, our heroes infiltrate the city of Purkoll, only to find themselves surrounded by Wat Tambor's forces....",
    "season": 7,
    "episode": 3,
    "date": "19 BBY",
    "irl_date": "2020-03-06T00:00:00"
  },
  {
    "title": "Unfinished Business (episode)",
    "link": "https://starwars.fandom.com/wiki/Unfinished_Business_(episode)",
    "description": "",
    "crawl": "Reunited! With the help of the Bad Batch, Captain Rex rescues his old friend, ARC Trooper Echo, from the Techno Union. The Separatists' loss of Echo's strategic algorithm provides a chance for the Republic to turn the tide in the Battle for Anaxes. However, Echo's horrifying experience behind enemy lines leaves lingering questions of his true loyalty and uncertain future....",
    "season": 7,
    "episode": 4,
    "date": "19 BBY",
    "irl_date": "2020-03-13T00:00:00"
  },
  {
    "title": "Gone with a Trace",
    "link": "https://starwars.fandom.com/wiki/Gone_with_a_Trace",
    "description": "Ahsoka befriends a pilot but must hide her Jedi past while trying to stop a dangerous droid.",
    "crawl": "Betrayal! Jedi Padawan Ahsoka Tano was wrongly accused of treason by the Jedi Council and hunted by the Grand Army of the Republic. Believing his apprentice was innocent, Anakin Skywalker discovered the true villain was Ahsoka's close friend Barriss Offee. Unable to reconcile her relationship with the Jedi Order, Ahsoka decided to walk away from the only life she had ever known....",
    "season": 7,
    "episode": 5,
    "date": "19 BBY",
    "irl_date": "2020-03-20T00:00:00"
  },
  {
    "title": "Deal No Deal",
    "link": "https://starwars.fandom.com/wiki/Deal_No_Deal",
    "description": "Trace makes a rash decision after learning what they are transporting is for the Pyke Syndicate.",
    "crawl": "Crossroads! After leaving the Jedi Order, Ahsoka Tano finds herself far away from the life she once knew. Here in the underworld of Coruscant, she meets Trace Martez, an aspiring pilot, and her older sister Rafa, a streetwise gambler with lofty aspirations. In their short time together, Ahsoka realizes not everyone sees the Jedi as heroes, a lesson she only recently learned herself....",
    "season": 7,
    "episode": 6,
    "date": "19 BBY",
    "irl_date": "2020-03-27T00:00:00"
  },
  {
    "title": "Dangerous Debt",
    "link": "https://starwars.fandom.com/wiki/Dangerous_Debt",
    "description": "Taken prisoner by the Pykes, Ahsoka and the Martez sisters attempt to escape.",
    "crawl": "Prisoners of the Pykes! Ahsoka Tano has teamed up with the Martez sisters, who live in the underworld of the city-planet Coruscant. Struggling to make ends meet, Rafa Martez scored a job running a spice shipment from the planet Kessel. Tempers flared when Ahsoka realized the spice was being sold to the Pykes, a powerful crime syndicate. As Ahsoka and Rafa argue, Trace Martez dumped the spice, hoping to end the dispute. With no shipment to deliver, the three attempted to deceive the Pykes and failed. We now find them imprisoned deep within a fortress on the planet Oba Diah....",
    "season": 7,
    "episode": 7,
    "date": "19 BBY",
    "irl_date": "2020-04-03T00:00:00"
  },
  {
    "title": "Together Again",
    "link": "https://starwars.fandom.com/wiki/Together_Again",
    "description": "Ahsoka bargains for the sisters' freedom and makes a startling discovery.",
    "crawl": "Prisoners in peril! Former Jedi apprentice, Ahsoka Tano, befriended two sisters, Trace and Rafa Martez, who grew up in the underworld of Coruscant. After learning that the sisters blamed the Jedi Knights for the death of their parents, Ahsoka must decide if she's willing to reveal her Jedi past and use her skills to aid in their escape. Fearing her new friends will feel betrayed by this revelation, Ahsoka is left with a difficult choice....",
    "season": 7,
    "episode": 8,
    "date": "19 BBY",
    "irl_date": "2020-04-10T00:00:00"
  },
  {
    "title": "Old Friends Not Forgotten",
    "link": "https://starwars.fandom.com/wiki/Old_Friends_Not_Forgotten",
    "description": "The siege of Mandalore begins, and Ahsoka turns to Anakin and Obi-Wan for help.",
    "crawl": "Outer Rim under siege! Separatist forces have launched a major offensive. Led by the evil droid General Grievous, Republic forces are pushed to the brink. In response to this overwhelming attack, the Jedi Council has dispatched its Generals, sending them far from the Core Worlds to bolster the beleaguered clones. On the distant planet of Yerbana, we find Commander Cody of the 212th in desperate need of reinforcements....",
    "season": 7,
    "episode": 9,
    "date": "19 BBY",
    "irl_date": "2020-04-17T00:00:00"
  },
  {
    "title": "The Phantom Apprentice",
    "link": "https://starwars.fandom.com/wiki/The_Phantom_Apprentice",
    "description": "The battle for Mandalore continues, and Ahsoka finds herself face to face with Maul.",
    "crawl": "",
    "season": 7,
    "episode": 10,
    "date": "19 BBY",
    "irl_date": "2020-04-24T00:00:00"
  },
  {
    "title": "Shattered",
    "link": "https://starwars.fandom.com/wiki/Shattered",
    "description": "Maul is captured and the Siege of Mandalore is won. But evil lurks elsewhere, and the galaxy will never be the same.",
    "crawl": "",
    "season": 7,
    "episode": 11,
    "date": "19 BBY",
    "irl_date": "2020-05-01T00:00:00"
  },
  {
    "title": "Victory and Death",
    "link": "https://starwars.fandom.com/wiki/Victory_and_Death",
    "description": "In the wake of Order 66, Ahsoka and Rex must work together to survive.",
    "crawl": "",
    "season": 7,
    "episode": 12,
    "date": "19 BBY",
    "irl_date": "2020-05-04T00:00:00"
  }
]